rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
/*
 * Copyright (c) 2024 Realtek Semiconductor Corp.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef PCC_REG_H
#define PCC_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================                PCC Register               ================ */
/* ===========     Reference: Bee4_PERI-ON_20221201_v1.xlsx     =========== */
/* ================================================================================ */
typedef struct
{
    /* 0x300        0x4000_2300
        3:0     R/W    r_spic0_div_sel                 4'h0
        4       R/W    r_spic0_div_en                  1'h0
        5       R/W    r_spic0_clk_src_en              1'h1
        6       R/W    RSVD                            1'h0
        7       R/W    RSVD                            1'h0
        8       R/W    r_spic0_mux_1_clk_cg_en         1'h1
        9       R/W    r_spic0_clk_src_sel0            1'h0
        10      R/W    r_spic0_clk_src_sel1            1'h0
        11      R/W    RSVD                            1'h0
        15:12   R/W    RSVD                            4'h0
        17:16   R/W    r_flash0_phy_clk_sel            2'h0
        18      R/W    r_flash0_clk_inv_en             1'b0
        26:19   R/W    r_pon_dlysel_spic0              8'h0
        27      R/W    spic0_phy_func_en               1'h0
        28      R/W    spic0_phy_str_en                1'h1
        29      R/W    RSVD                            1'h0
        30      R/W    spic0_ck_en                     1'h0
        31      R/W    spic0_func_en                   1'h0
    */
    union
    {
        __IO uint32_t REG_PERI_SPIC0_CTL;
        struct
        {
            __IO uint32_t r_spic0_div_sel: 4;
            __IO uint32_t r_spic0_div_en: 1;
            __IO uint32_t r_spic0_clk_src_en: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t r_spic0_mux_1_clk_cg_en: 1;
            __IO uint32_t r_spic0_clk_src_sel0: 1;
            __IO uint32_t r_spic0_clk_src_sel1: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 4;
            __IO uint32_t r_flash0_phy_clk_sel: 2;
            __IO uint32_t r_flash0_clk_inv_en: 1;
            __IO uint32_t r_pon_dlysel_spic0: 8;
            __IO uint32_t spic0_phy_func_en: 1;
            __IO uint32_t spic0_phy_str_en: 1;
            __IO uint32_t RESERVED_0: 1;
            __IO uint32_t spic0_ck_en: 1;
            __IO uint32_t spic0_func_en: 1;
        } BITS_300;
    } u_300;

    /* 0x304        0x4000_2304
        3:0     R/W    r_spic1_div_sel                 4'h0
        4       R/W    r_spic1_div_en                  1'h0
        5       R/W    r_spic1_clk_src_en              1'h1
        6       R/W    RSVD                            1'h0
        7       R/W    RSVD                            1'h0
        8       R/W    r_spic1_mux_1_clk_cg_en         1'h0
        9       R/W    r_spic1_clk_src_sel0            1'h0
        10      R/W    r_spic1_clk_src_sel1            1'h0
        11      R/W    RSVD                            1'h0
        15:12   R/W    RSVD                            4'h0
        17:16   R/W    r_spic1_phy_clk_sel             2'h0
        18      R/W    r_spic1_clk_inv_en              1'b0
        26:19   R/W    r_pon_dlysel_spic1              8'h0
        27      R/W    spic1_phy_func_en               1'h0
        28      R/W    spic1_phy_str_en                1'h0
        29      R/W    spic1_phy_apb_ck_en             1'h0
        30      R/W    spic1_ck_en                     1'h0
        31      R/W    spic1_func_en                   1'h0
    */
    union
    {
        __IO uint32_t REG_PERI_SPIC1_CTL;
        struct
        {
            __IO uint32_t r_spic1_div_sel: 4;
            __IO uint32_t r_spic1_div_en: 1;
            __IO uint32_t r_spic1_clk_src_en: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t r_spic1_mux_1_clk_cg_en: 1;
            __IO uint32_t r_spic1_clk_src_sel0: 1;
            __IO uint32_t r_spic1_clk_src_sel1: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 4;
            __IO uint32_t r_spic1_phy_clk_sel: 2;
            __IO uint32_t r_spic1_clk_inv_en: 1;
            __IO uint32_t r_pon_dlysel_spic1: 8;
            __IO uint32_t spic1_phy_func_en: 1;
            __IO uint32_t spic1_phy_str_en: 1;
            __IO uint32_t spic1_phy_apb_ck_en: 1;
            __IO uint32_t spic1_ck_en: 1;
            __IO uint32_t spic1_func_en: 1;
        } BITS_304;
    } u_304;

    /* 0x308        0x4000_2308
        3:0     R/W    r_spic2_div_sel                 4'h0
        4       R/W    r_spic2_div_en                  1'h0
        5       R/W    r_spic2_clk_src_en              1'h1
        6       R/W    RSVD                            1'h0
        7       R/W    RSVD                            1'h0
        8       R/W    r_spic2_mux_1_clk_cg_en         1'h0
        9       R/W    r_spic2_clk_src_sel0            1'h0
        10      R/W    r_spic2_clk_src_sel1            1'h0
        11      R/W    RSVD                            1'h0
        15:12   R/W    RSVD                            4'h0
        17:16   R/W    r_spic2_phy_clk_sel             2'h0
        18      R/W    r_spic2_clk_inv_en              1'b0
        26:19   R/W    r_pon_dlysel_spic2              8'h0
        27      R/W    spic2_phy_func_en               1'h0
        28      R/W    spic2_phy_str_en                1'h0
        29      R/W    RSVD                            1'h0
        30      R/W    spic2_ck_en                     1'h0
        31      R/W    spic2_func_en                   1'h0
    */
    union
    {
        __IO uint32_t REG_PERI_SPIC2_CTL;
        struct
        {
            __IO uint32_t r_spic2_div_sel: 4;
            __IO uint32_t r_spic2_div_en: 1;
            __IO uint32_t r_spic2_clk_src_en: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t r_spic2_mux_1_clk_cg_en: 1;
            __IO uint32_t r_spic2_clk_src_sel0: 1;
            __IO uint32_t r_spic2_clk_src_sel1: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 4;
            __IO uint32_t r_spic2_phy_clk_sel: 2;
            __IO uint32_t r_spic2_clk_inv_en: 1;
            __IO uint32_t r_pon_dlysel_spic2: 8;
            __IO uint32_t spic2_phy_func_en: 1;
            __IO uint32_t spic2_phy_str_en: 1;
            __IO uint32_t RESERVED_0: 1;
            __IO uint32_t spic2_ck_en: 1;
            __IO uint32_t spic2_func_en: 1;
        } BITS_308;
    } u_308;

