rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0x30C        0x4000_230c
        0       R/W    gdma0_func_en                   1'h0
        1       R/W    gdma0_ck_en                     1'h0
        31:2    R/W    RSVD                            30'h0
    */
    union
    {
        __IO uint32_t REG_DMA_CTRL0;
        struct
        {
            __IO uint32_t gdma0_func_en: 1;
            __IO uint32_t gdma0_ck_en: 1;
            __IO uint32_t RESERVED_0: 30;
        } BITS_30C;
    } u_30C;

    /* 0x310        0x4000_2310
        0       R/W    spi0_func_en                    1'h0
        1       R/W    spi0_ck_en                      1'h0
        2       R/W    spi0_div_en                     1'h0
        5:3     R/W    spi0_div_sel                    3'b000
        6       R/W    spi0_brg_en                     1'h0
        7       R/W    spi0_hs_ck_en                   1'h0
        8       R/W    spi1_func_en                    1'h0
        9       R/W    spi1_ck_en                      1'h0
        10      R/W    spi1_div_en                     1'h0
        13:11   R/W    spi1_div_sel                    3'b000
        14      R/W    spi1_brg_en                     1'h0
        15      R/W    PON_SPI0_MST                    1'h0
        16      R/W    spi0_s_func_en                  1'h0
        17      R/W    spi0_s_ck_en                    1'h0
        18      R/W    spi0_s_div_en                   1'h0
        21:19   R/W    spi0_s_div_sel                  3'b000
        22      R/W    RSVD                            1'h0
        23      R/W    RSVD                            1'h0
        24      R/W    spi0_src_clk_sel0               1'h0
        25      R/W    spi0_src_clk_sel1               1'h0
        26      R/W    spi0_s_src_clk_sel0             1'h0
        27      R/W    spi0_s_src_clk_sel1             1'h0
        28      R/W    spi0_mux_clk_cg_en              1'h0
        29      R/W    spi0_s_mux_clk_cg_en            1'h0
        31:30   R/W    RSVD                            2'h0
    */
    union
    {
        __IO uint32_t REG_SPI_PERI_CTL0;
        struct
        {
            __IO uint32_t spi0_func_en: 1;
            __IO uint32_t spi0_ck_en: 1;
            __IO uint32_t spi0_div_en: 1;
            __IO uint32_t spi0_div_sel: 3;
            __IO uint32_t spi0_brg_en: 1;
            __IO uint32_t spi0_hs_ck_en: 1;
            __IO uint32_t spi1_func_en: 1;
            __IO uint32_t spi1_ck_en: 1;
            __IO uint32_t spi1_div_en: 1;
            __IO uint32_t spi1_div_sel: 3;
            __IO uint32_t spi1_brg_en: 1;
            __IO uint32_t PON_SPI0_MST: 1;
            __IO uint32_t spi0_s_func_en: 1;
            __IO uint32_t spi0_s_ck_en: 1;
            __IO uint32_t spi0_s_div_en: 1;
            __IO uint32_t spi0_s_div_sel: 3;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t spi0_src_clk_sel0: 1;
            __IO uint32_t spi0_src_clk_sel1: 1;
            __IO uint32_t spi0_s_src_clk_sel0: 1;
            __IO uint32_t spi0_s_src_clk_sel1: 1;
            __IO uint32_t spi0_mux_clk_cg_en: 1;
            __IO uint32_t spi0_s_mux_clk_cg_en: 1;
            __IO uint32_t RESERVED_0: 2;
        } BITS_310;
    } u_310;

    /* 0x314        0x4000_2314
        0       R/W    i2c0_func_en                    1'h0
        1       R/W    i2c0_ck_en                      1'h0
        2       R/W    i2c0_div_en                     1'h0
        5:3     R/W    i2c0_div_sel                    3'b000
        7:6     R/W    RSVD                            2'h0
        8       R/W    i2c1_func_en                    1'h0
        9       R/W    i2c1_ck_en                      1'h0
        10      R/W    i2c1_div_en                     1'h0
        13:11   R/W    i2c1_div_sel                    3'b000
        15:14   R/W    RSVD                            2'h0
        16      R/W    i2c2_func_en                    1'h0
        17      R/W    i2c2_ck_en                      1'h0
        18      R/W    i2c2_div_en                     1'h0
        21:19   R/W    i2c2_div_sel                    3'b000
        23:22   R/W    RSVD                            2'h0
        24      R/W    i2c3_func_en                    1'h0
        25      R/W    i2c3_ck_en                      1'h0
        26      R/W    i2c3_div_en                     1'h0
        29:27   R/W    i2c3_div_sel                    3'b000
        31:30   R/W    RSVD                            2'h0
    */
    union
    {
        __IO uint32_t REG_I2C_PERI_CTL0;
        struct
        {
            __IO uint32_t i2c0_func_en: 1;
            __IO uint32_t i2c0_ck_en: 1;
            __IO uint32_t i2c0_div_en: 1;
            __IO uint32_t i2c0_div_sel: 3;
            __IO uint32_t RESERVED_3: 2;
            __IO uint32_t i2c1_func_en: 1;
            __IO uint32_t i2c1_ck_en: 1;
            __IO uint32_t i2c1_div_en: 1;
            __IO uint32_t i2c1_div_sel: 3;
            __IO uint32_t RESERVED_2: 2;
            __IO uint32_t i2c2_func_en: 1;
            __IO uint32_t i2c2_ck_en: 1;
            __IO uint32_t i2c2_div_en: 1;
            __IO uint32_t i2c2_div_sel: 3;
            __IO uint32_t RESERVED_1: 2;
            __IO uint32_t i2c3_func_en: 1;
            __IO uint32_t i2c3_ck_en: 1;
            __IO uint32_t i2c3_div_en: 1;
            __IO uint32_t i2c3_div_sel: 3;
            __IO uint32_t RESERVED_0: 2;
        } BITS_314;
    } u_314;

    /* 0x318        0x4000_2318
        0       R/W    r_PMUX_1_WIRE_UART0_EN          1'h0
        1       R/W    rtk_uart0_func_en               1'h0
        2       R/W    rtk_uart0_ck_en                 1'h0
        3       R/W    rtk_uart0_div_en                1'h0
        6:4     R/W    rtk_uart0_div_sel               3'b000
        7       R/W    RSVD                            1'h0
        8       R/W    r_PMUX_1_WIRE_UART1_EN          1'h0
        9       R/W    rtk_uart1_func_en               1'h0
        10      R/W    rtk_uart1_ck_en                 1'h0
        11      R/W    rtk_uart1_div_en                1'h0
        14:12   R/W    rtk_uart1_div_sel               3'b000
        15      R/W    RSVD                            1'h0
        16      R/W    r_PMUX_1_WIRE_UART2_EN          1'h0
        17      R/W    rtk_uart2_func_en               1'h0
        18      R/W    rtk_uart2_ck_en                 1'h0
        19      R/W    rtk_uart2_div_en                1'h0
        22:20   R/W    rtk_uart2_div_sel               3'b000
        23      R/W    RSVD                            1'h0
        24      R/W    r_PMUX_1_WIRE_UART3_EN          1'h0
        25      R/W    rtk_uart3_func_en               1'h0
        26      R/W    rtk_uart3_ck_en                 1'h0
        27      R/W    rtk_uart3_div_en                1'h0
        30:28   R/W    rtk_uart3_div_sel               3'b000
        31      R/W    RSVD                            1'h0
    */
    union
    {
        __IO uint32_t REG_UART_PERI_CTL0;
        struct
        {
            __IO uint32_t r_PMUX_1_WIRE_UART0_EN: 1;
            __IO uint32_t rtk_uart0_func_en: 1;
            __IO uint32_t rtk_uart0_ck_en: 1;
            __IO uint32_t rtk_uart0_div_en: 1;
            __IO uint32_t rtk_uart0_div_sel: 3;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t r_PMUX_1_WIRE_UART1_EN: 1;
            __IO uint32_t rtk_uart1_func_en: 1;
            __IO uint32_t rtk_uart1_ck_en: 1;
            __IO uint32_t rtk_uart1_div_en: 1;
            __IO uint32_t rtk_uart1_div_sel: 3;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t r_PMUX_1_WIRE_UART2_EN: 1;
            __IO uint32_t rtk_uart2_func_en: 1;
            __IO uint32_t rtk_uart2_ck_en: 1;
            __IO uint32_t rtk_uart2_div_en: 1;
            __IO uint32_t rtk_uart2_div_sel: 3;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t r_PMUX_1_WIRE_UART3_EN: 1;
            __IO uint32_t rtk_uart3_func_en: 1;
            __IO uint32_t rtk_uart3_ck_en: 1;
            __IO uint32_t rtk_uart3_div_en: 1;
            __IO uint32_t rtk_uart3_div_sel: 3;
            __IO uint32_t RESERVED_0: 1;
        } BITS_318;
    } u_318;

    /* 0x31C        0x4000_231c
        0       R/W    auxadc_func_en                  1'h0
        1       R/W    auxadc_ck_en                    1'h0
        2       R/W    adc24b_func_en                  1'h0
        3       R/W    adc24b_ck_en                    1'h0
        4       R/W    RSVD                            1'h0
        5       R/W    RSVD                            1'h0
        6       R/W    keyscan_func_en                 1'h0
        7       R/W    keyscan_ck_en                   1'h0
        8       R/W    RSVD                            1'h0
        9       R/W    RSVD                            1'h0
        10      R/W    ppe_func_en                     1'h0
        11      R/W    ppe_ck_en                       1'h0
        12      R/W    gmac_func_en                    1'h0
        13      R/W    RSVD                            1'h0
        14      R/W    spi3w_func_en                   1'h0
        15      R/W    spi3w_ck_en                     1'h0
        16      R/W    RSVD                            1'h0
        17      R/W    RSVD                            1'h0
        18      R/W    segcom_func_en                  1'h0
        19      R/W    segcom_ck_en                    1'h0
        20      R/W    bt_mac_func_en                  1'h1
        21      R/W    bt_mac_ck_en                    1'h1
        22      R/W    bt_phy_func_en                  1'h0
        23      R/W    bt_phy_ck_en                    1'h0
        24      R/W    zb_mac_func_en                  1'h0
        25      R/W    zb_mac_ck_en                    1'h0
        26      R/W    bt_vendor_ck_en                 1'h1
        27      R/W    bt_cal32k_ck_en                 1'h0
        28      R/W    pdck_func_en                    1'h0
        29      R/W    pdck_ck_en                      1'h0
        30      R/W    aac_xtal_func_en                1'h0
        31      R/W    aac_xtal_ck_en                  1'h0
    */
    union
    {
        __IO uint32_t REG_GENERAL_PERI_CTL0;
        struct
        {
            __IO uint32_t auxadc_func_en: 1;
            __IO uint32_t auxadc_ck_en: 1;
            __IO uint32_t adc24b_func_en: 1;
            __IO uint32_t adc24b_ck_en: 1;
            __IO uint32_t RESERVED_6: 1;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t keyscan_func_en: 1;
            __IO uint32_t keyscan_ck_en: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t ppe_func_en: 1;
            __IO uint32_t ppe_ck_en: 1;
            __IO uint32_t gmac_func_en: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t spi3w_func_en: 1;
            __IO uint32_t spi3w_ck_en: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 1;
            __IO uint32_t segcom_func_en: 1;
            __IO uint32_t segcom_ck_en: 1;
            __IO uint32_t bt_mac_func_en: 1;
            __IO uint32_t bt_mac_ck_en: 1;
            __IO uint32_t bt_phy_func_en: 1;
            __IO uint32_t bt_phy_ck_en: 1;
            __IO uint32_t zb_mac_func_en: 1;
            __IO uint32_t zb_mac_ck_en: 1;
            __IO uint32_t bt_vendor_ck_en: 1;
            __IO uint32_t bt_cal32k_ck_en: 1;
            __IO uint32_t pdck_func_en: 1;
            __IO uint32_t pdck_ck_en: 1;
            __IO uint32_t aac_xtal_func_en: 1;
            __IO uint32_t aac_xtal_ck_en: 1;
        } BITS_31C;
    } u_31C;

    /* 0x320        0x4000_2320
        0       R/W    gpio_a_func_en                  1'h0
        1       R/W    gpio_a_ck_en                    1'h0
        2       R/W    gpio_a_deb_ck_en                1'h0
        3       R/W    gpio_a_deb_clk_sel              1'h0
        4       R/W    gpio_b_func_en                  1'h0
        5       R/W    gpio_b_ck_en                    1'h0
        6       R/W    gpio_b_deb_ck_en                1'h0
        7       R/W    gpio_b_deb_clk_sel              1'h0
        8       R/W    RSVD                            1'h0
        9       R/W    simc_ck_en                      1'h0
        10      R/W    simc_func_en                    1'h0
        11      R/W    RSVD                            1'h0
        12      R/W    RSVD                            1'h0
        13      R/W    RSVD                            1'h0
        14      R/W    RSVD                            1'h0
        15      R/W    r_ir_mux_clk_cg_en              1'h0
        16      R/W    r_pll_ir_div_sel                1'h0
        17      R/W    r_pll_ir_src_sel                1'h0
        18      R/W    r_sclk_ir_src_sel               1'h0
        19      R/W    ir_ck_en                        1'h0
        20      R/W    ir_func_en                      1'h0
        22:21   R/W    r_can_lp_scan_div_sel           2'h0
        23      R/W    r_can_scan_div_sel              1'h0
        24      R/W    can_ck_en                       1'h0
        25      R/W    can_func_en                     1'h0
        29:26   R/W    RSVD                            4'h0
        30      R/W    RSVD                            1'h0
        31      R/W    RSVD                            1'h0
    */
    union
    {
        __IO uint32_t REG_GENERAL_PERI_CTL1;
        struct
        {
            __IO uint32_t gpio_a_func_en: 1;
            __IO uint32_t gpio_a_ck_en: 1;
            __IO uint32_t gpio_a_deb_ck_en: 1;
            __IO uint32_t gpio_a_deb_clk_sel: 1;
            __IO uint32_t gpio_b_func_en: 1;
            __IO uint32_t gpio_b_ck_en: 1;
            __IO uint32_t gpio_b_deb_ck_en: 1;
            __IO uint32_t gpio_b_deb_clk_sel: 1;
            __IO uint32_t RESERVED_7: 1;
            __IO uint32_t simc_ck_en: 1;
            __IO uint32_t simc_func_en: 1;
            __IO uint32_t RESERVED_6: 1;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t r_ir_mux_clk_cg_en: 1;
            __IO uint32_t r_pll_ir_div_sel: 1;
            __IO uint32_t r_pll_ir_src_sel: 1;
            __IO uint32_t r_sclk_ir_src_sel: 1;
            __IO uint32_t ir_ck_en: 1;
            __IO uint32_t ir_func_en: 1;
            __IO uint32_t r_can_lp_scan_div_sel: 2;
            __IO uint32_t r_can_scan_div_sel: 1;
            __IO uint32_t can_ck_en: 1;
            __IO uint32_t can_func_en: 1;
            __IO uint32_t RESERVED_2: 4;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 1;
        } BITS_320;
    } u_320;

    /* 0x324        0x4000_2324
        2:0     R/W    RSVD                            1'h0
        3       R/W    RSVD                            1'h0
        4       R/W    RSVD                            1'h0
        5       R/W    RSVD                            1'h0
        6       R/W    RSVD                            1'h0
        7       R/W    rtzip_ck_en                     1'h0
        8       R/W    rtzip_func_en                   1'h0
        15:9    R/W    RSVD                            7'h0
        18:16   R/W    r_disp_div_sel                  3'h0
        19      R/W    r_disp_div_en                   1'h0
        20      R/W    r_disp_mux_clk_cg_en            1'h0
        21      R/W    r_disp_clk_src_sel1             1'h0
        22      R/W    r_disp_clk_src_sel0             1'h0
        23      R/W    disp_ck_en                      1'h0
        24      R/W    disp_func_en                    1'h0
        31:25   R/W    RSVD                            7'h0
    */
    union
    {
        __IO uint32_t REG_GENERAL_PERI_CTL2;
        struct
        {
            __IO uint32_t RESERVED_6: 3;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t rtzip_ck_en: 1;
            __IO uint32_t rtzip_func_en: 1;
            __IO uint32_t RESERVED_1: 7;
            __IO uint32_t r_disp_div_sel: 3;
            __IO uint32_t r_disp_div_en: 1;
            __IO uint32_t r_disp_mux_clk_cg_en: 1;
            __IO uint32_t r_disp_clk_src_sel1: 1;
            __IO uint32_t r_disp_clk_src_sel0: 1;
            __IO uint32_t disp_ck_en: 1;
            __IO uint32_t disp_func_en: 1;
            __IO uint32_t RESERVED_0: 7;
        } BITS_324;
    } u_324;

    /* 0x328        0x4000_2328
        2:0     R/W    r_timer_1_div_sel               3'h0
        3       R/W    r_timer_1_div_en                1'h0
        4       R/W    RSVD                            1'h0
        7:5     R/W    RSVD                            3'h0
        8       R/W    RSVD                            1'h0
        9       R/W    RSVD                            1'h0
        10      R/W    RSVD                            1'h0
        11      R/W    RSVD                            1'h0
        15:12   R/W    RSVD                            4'h0
        18:16   R/W    r_timer_2_div_sel               3'h0
        19      R/W    r_timer_2_div_en                1'h0
        20      R/W    RSVD                            1'h0
        23:21   R/W    RSVD                            3'h0
        24      R/W    RSVD                            1'h0
        25      R/W    RSVD                            1'h0
        26      R/W    RSVD                            1'h0
        27      R/W    RSVD                            1'h0
        28      R/W    RSVD                            1'h0
        29      R/W    slv_clk_timer_apb_g             1'h0
        30      R/W    r_timer_func_en                 1'h0
        31      R/W    r_timer_ck_en                   1'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_0_CLOCK_CTRL;
        struct
        {
            __IO uint32_t r_timer_1_div_sel: 3;
            __IO uint32_t r_timer_1_div_en: 1;
            __IO uint32_t RESERVED_13: 1;
            __IO uint32_t RESERVED_12: 3;
            __IO uint32_t RESERVED_11: 1;
            __IO uint32_t RESERVED_10: 1;
            __IO uint32_t RESERVED_9: 1;
            __IO uint32_t RESERVED_8: 1;
            __IO uint32_t RESERVED_7: 4;
            __IO uint32_t r_timer_2_div_sel: 3;
            __IO uint32_t r_timer_2_div_en: 1;
            __IO uint32_t RESERVED_6: 1;
            __IO uint32_t RESERVED_5: 3;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 1;
            __IO uint32_t slv_clk_timer_apb_g: 1;
            __IO uint32_t r_timer_func_en: 1;
            __IO uint32_t r_timer_ck_en: 1;
        } BITS_328;
    } u_328;

    /* 0x32C        0x4000_232c
        2:0     R/W    r_timer_3_div_sel               3'h0
        3       R/W    r_timer_3_div_en                1'h0
        4       R/W    r_timer_3_clk_sel2              1'h0
        8:5     R/W    RSVD                            4'h0
        9       R/W    r_timer_pwm_wrap3_clk_sel       1'h0
        10      R/W    r_timer_pwm_wrap3_func_en       1'h0
        11      R/W    r_timer_pwm_wrap3_ck_en         1'h0
        12      R/W    r_timer_3_clk_sel1              1'h0
        13      R/W    r_timer_3_clk_sel0              1'h0
        15:14   R/W    RSVD                            2'h0
        18:16   R/W    r_timer_4_div_sel               3'h0
        19      R/W    r_timer_4_div_en                1'h0
        20      R/W    r_timer_4_clk_sel2              1'h0
        24:21   R/W    RSVD                            4'h0
        25      R/W    r_timer_pwm_wrap4_clk_sel       1'h0
        26      R/W    r_timer_pwm_wrap4_func_en       1'h0
        27      R/W    r_timer_pwm_wrap4_ck_en         1'h0
        28      R/W    r_timer_4_clk_sel1              1'h0
        29      R/W    r_timer_4_clk_sel0              1'h0
        31:30   R/W    RSVD                            2'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_1_CLOCK_CTRL;
        struct
        {
            __IO uint32_t r_timer_3_div_sel: 3;
            __IO uint32_t r_timer_3_div_en: 1;
            __IO uint32_t r_timer_3_clk_sel2: 1;
            __IO uint32_t RESERVED_3: 4;
            __IO uint32_t r_timer_pwm_wrap3_clk_sel: 1;
            __IO uint32_t r_timer_pwm_wrap3_func_en: 1;
            __IO uint32_t r_timer_pwm_wrap3_ck_en: 1;
            __IO uint32_t r_timer_3_clk_sel1: 1;
            __IO uint32_t r_timer_3_clk_sel0: 1;
            __IO uint32_t RESERVED_2: 2;
            __IO uint32_t r_timer_4_div_sel: 3;
            __IO uint32_t r_timer_4_div_en: 1;
            __IO uint32_t r_timer_4_clk_sel2: 1;
            __IO uint32_t RESERVED_1: 4;
            __IO uint32_t r_timer_pwm_wrap4_clk_sel: 1;
            __IO uint32_t r_timer_pwm_wrap4_func_en: 1;
            __IO uint32_t r_timer_pwm_wrap4_ck_en: 1;
            __IO uint32_t r_timer_4_clk_sel1: 1;
            __IO uint32_t r_timer_4_clk_sel0: 1;
            __IO uint32_t RESERVED_0: 2;
        } BITS_32C;
    } u_32C;

