rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0x330        0x4000_2330
        2:0     R/W    r_timer_5_div_sel               3'h0
        3       R/W    r_timer_5_div_en                1'h0
        4       R/W    r_timer_5_clk_sel2              1'h0
        11:5    R/W    RSVD                            7'h0
        12      R/W    r_timer_5_clk_sel1              1'h0
        13      R/W    r_timer_5_clk_sel0              1'h0
        15:14   R/W    RSVD                            2'h0
        18:16   R/W    r_timer_6_div_sel               3'h0
        19      R/W    r_timer_6_div_en                1'h0
        20      R/W    r_timer_6_clk_sel2              1'h0
        27:21   R/W    RSVD                            7'h0
        28      R/W    r_timer_6_clk_sel1              1'h0
        29      R/W    r_timer_6_clk_sel0              1'h0
        31:30   R/W    RSVD                            2'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_2_CLOCK_CTRL;
        struct
        {
            __IO uint32_t r_timer_5_div_sel: 3;
            __IO uint32_t r_timer_5_div_en: 1;
            __IO uint32_t r_timer_5_clk_sel2: 1;
            __IO uint32_t RESERVED_3: 7;
            __IO uint32_t r_timer_5_clk_sel1: 1;
            __IO uint32_t r_timer_5_clk_sel0: 1;
            __IO uint32_t RESERVED_2: 2;
            __IO uint32_t r_timer_6_div_sel: 3;
            __IO uint32_t r_timer_6_div_en: 1;
            __IO uint32_t r_timer_6_clk_sel2: 1;
            __IO uint32_t RESERVED_1: 7;
            __IO uint32_t r_timer_6_clk_sel1: 1;
            __IO uint32_t r_timer_6_clk_sel0: 1;
            __IO uint32_t RESERVED_0: 2;
        } BITS_330;
    } u_330;

    /* 0x334        0x4000_2334
        2:0     R/W    r_timer_7_div_sel               3'h0
        3       R/W    r_timer_7_div_en                1'h0
        4       R/W    r_timer_7_clk_sel2              1'h0
        11:5    R/W    RSVD                            7'h0
        12      R/W    r_timer_7_clk_sel1              1'h0
        13      R/W    r_timer_7_clk_sel0              1'h0
        15:14   R/W    RSVD                            2'h0
        18:16   R/W    r_timer_8_div_sel               3'h0
        19      R/W    r_timer_8_div_en                1'h0
        20      R/W    r_timer_8_clk_sel2              1'h0
        27:21   R/W    RSVD                            7'h0
        28      R/W    r_timer_8_clk_sel1              1'h0
        29      R/W    r_timer_8_clk_sel0              1'h0
        31:30   R/W    RSVD                            2'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_3_CLOCK_CTRL;
        struct
        {
            __IO uint32_t r_timer_7_div_sel: 3;
            __IO uint32_t r_timer_7_div_en: 1;
            __IO uint32_t r_timer_7_clk_sel2: 1;
            __IO uint32_t RESERVED_3: 7;
            __IO uint32_t r_timer_7_clk_sel1: 1;
            __IO uint32_t r_timer_7_clk_sel0: 1;
            __IO uint32_t RESERVED_2: 2;
            __IO uint32_t r_timer_8_div_sel: 3;
            __IO uint32_t r_timer_8_div_en: 1;
            __IO uint32_t r_timer_8_clk_sel2: 1;
            __IO uint32_t RESERVED_1: 7;
            __IO uint32_t r_timer_8_clk_sel1: 1;
            __IO uint32_t r_timer_8_clk_sel0: 1;
            __IO uint32_t RESERVED_0: 2;
        } BITS_334;
    } u_334;

    /* 0x338        0x4000_2338
        31:0    R/W    RSVD                           32'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_PWM_WRAP_0_CFG;
        struct
        {
            __IO uint32_t RESERVED_0: 32;
        } BITS_338;
    } u_338;

    /* 0x33C        0x4000_233c
        7:0     R/W    timer_pwm_3_dead_zone_size      8'h0
        8       R/W    timer_pwm_3_emg_stop            1'h0
        9       R/W    timer_pwm_3_stop_state[0]       1'h0
        10      R/W    timer_pwm_3_stop_state[1]       1'h0
        11      R/W    timer_pwm_3_dummy_b11           1'h0
        12      R/W    timer_pwm_3_dead_zone_en        1'h0
        13      R/W    timer_pwm_3_pwm_pn_invserse_sel 1'h0
        14      R/W    timer_pwm_3_dummy_b14           1'h0
        15      R/W    timer_pwm_3_dummy_b15           1'h0
        23:16   R/W    timer_pwm_4_dead_zone_size      8'h0
        24      R/W    timer_pwm_4_emg_stop            1'h0
        25      R/W    timer_pwm_4_stop_state[0]       1'h0
        26      R/W    timer_pwm_4_stop_state[1]       1'h0
        27      R/W    timer_pwm_4_dummy_b11           1'h0
        28      R/W    timer_pwm_4_dead_zone_en        1'h0
        29      R/W    timer_pwm_4_pwm_pn_invserse_sel 1'h0
        30      R/W    timer_pwm_4_dummy_b14           1'h0
        31      R/W    timer_pwm_4_dummy_b15           1'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_PWM_WRAP_1_CFG;
        struct
        {
            __IO uint32_t timer_pwm_3_dead_zone_size: 8;
            __IO uint32_t timer_pwm_3_emg_stop: 1;
            __IO uint32_t timer_pwm_3_stop_state_0: 1;
            __IO uint32_t timer_pwm_3_stop_state_1: 1;
            __IO uint32_t timer_pwm_3_dummy_b11: 1;
            __IO uint32_t timer_pwm_3_dead_zone_en: 1;
            __IO uint32_t timer_pwm_3_pwm_pn_invserse_sel: 1;
            __IO uint32_t timer_pwm_3_dummy_b14: 1;
            __IO uint32_t timer_pwm_3_dummy_b15: 1;
            __IO uint32_t timer_pwm_4_dead_zone_size: 8;
            __IO uint32_t timer_pwm_4_emg_stop: 1;
            __IO uint32_t timer_pwm_4_stop_state_0: 1;
            __IO uint32_t timer_pwm_4_stop_state_1: 1;
            __IO uint32_t timer_pwm_4_dummy_b11: 1;
            __IO uint32_t timer_pwm_4_dead_zone_en: 1;
            __IO uint32_t timer_pwm_4_pwm_pn_invserse_sel: 1;
            __IO uint32_t timer_pwm_4_dummy_b14: 1;
            __IO uint32_t timer_pwm_4_dummy_b15: 1;
        } BITS_33C;
    } u_33C;

    /* 0x340        0x4000_2340
        31:0    R/W    RSVD                            32'h0
    */
    union
    {
        __IO uint32_t REG_TIMER_PWM_WRAP_2_CFG;
        struct
        {
            __IO uint32_t RESERVED_0: 32;
        } BITS_340;
    } u_340;

    /* 0x344        0x4000_2344
        2:0     R/W    r_etimer_0_div_sel              3'h0
        3       R/W    r_etimer_0_div_en               1'h0
        4       R/W    r_etimer_01_clk_src_sel2        1'h0
        5       R/W    r_etimer_01_clk_src_sel1        1'h0
        6       R/W    r_etimer_01_clk_src_sel0        1'h0
        9:7     R/W    r_etimer_pwm_0_div_sel          3'h0
        10      R/W    r_etimer_pwm_0_div_en           1'h0
        11      R/W    r_etimer_pwm_0_clk_src_sel      1'h0
        12      R/W    r_etimer_pwm_0_func_en          1'h0
        13      R/W    r_etimer_pwm_0_ck_en            1'h0
        15:14   R/W    RSVD                            2'h0
        18:16   R/W    r_etimer_1_div_sel              3'h0
        19      R/W    r_etimer_1_div_en               1'h0
        22:20   R/W    RSVD                            3'h0
        25:23   R/W    r_etimer_pwm_1_div_sel          3'h0
        26      R/W    r_etimer_pwm_1_div_en           1'h0
        27      R/W    r_etimer_pwm_1_clk_src_sel      1'h0
        28      R/W    r_etimer_pwm_1_func_en          1'h0
        29      R/W    r_etimer_pwm_1_ck_en            1'h0
        30      R/W    r_etimer_func_en                1'h0
        31      R/W    r_etimer_ck_en                  1'h0
    */
    union
    {
        __IO uint32_t REG_ENHTIMER_1_0_CLOCK_CTRL;
        struct
        {
            __IO uint32_t r_etimer_0_div_sel: 3;
            __IO uint32_t r_etimer_0_div_en: 1;
            __IO uint32_t r_etimer_01_clk_src_sel2: 1;
            __IO uint32_t r_etimer_01_clk_src_sel1: 1;
            __IO uint32_t r_etimer_01_clk_src_sel0: 1;
            __IO uint32_t r_etimer_pwm_0_div_sel: 3;
            __IO uint32_t r_etimer_pwm_0_div_en: 1;
            __IO uint32_t r_etimer_pwm_0_clk_src_sel: 1;
            __IO uint32_t r_etimer_pwm_0_func_en: 1;
            __IO uint32_t r_etimer_pwm_0_ck_en: 1;
            __IO uint32_t RESERVED_1: 2;
            __IO uint32_t r_etimer_1_div_sel: 3;
            __IO uint32_t r_etimer_1_div_en: 1;
            __IO uint32_t RESERVED_0: 3;
            __IO uint32_t r_etimer_pwm_1_div_sel: 3;
            __IO uint32_t r_etimer_pwm_1_div_en: 1;
            __IO uint32_t r_etimer_pwm_1_clk_src_sel: 1;
            __IO uint32_t r_etimer_pwm_1_func_en: 1;
            __IO uint32_t r_etimer_pwm_1_ck_en: 1;
            __IO uint32_t r_etimer_func_en: 1;
            __IO uint32_t r_etimer_ck_en: 1;
        } BITS_344;
    } u_344;

    /* 0x348        0x4000_2348
        2:0     R/W    r_etimer_2_div_sel              3'h0
        3       R/W    r_etimer_2_div_en               1'h0
        4       R/W    r_etimer_23_clk_src_sel2        1'h0
        5       R/W    r_etimer_23_clk_src_sel1        1'h0
        6       R/W    r_etimer_23_clk_src_sel0        1'h0
        9:7     R/W    r_etimer_pwm_2_div_sel          3'h0
        10      R/W    r_etimer_pwm_2_div_en           1'h0
        11      R/W    r_etimer_pwm_2_clk_src_sel      1'h0
        12      R/W    r_etimer_pwm_2_func_en          1'h0
        13      R/W    r_etimer_pwm_2_ck_en            1'h0
        15:14   R/W    RSVD                            2'h0
        18:16   R/W    r_etimer_3_div_sel              3'h0
        19      R/W    r_etimer_3_div_en               1'h0
        22:20   R/W    RSVD                            3'h0
        25:23   R/W    r_etimer_pwm_3_div_sel          3'h0
        26      R/W    r_etimer_pwm_3_div_en           1'h0
        27      R/W    r_etimer_pwm_3_clk_src_sel      1'h0
        28      R/W    r_etimer_pwm_3_func_en          1'h0
        29      R/W    r_etimer_pwm_3_ck_en            1'h0
        31:30   R/W    RSVD                            2'h0
    */
    union
    {
        __IO uint32_t REG_ENHTIMER_3_2_CLOCK_CTRL;
        struct
        {
            __IO uint32_t r_etimer_2_div_sel: 3;
            __IO uint32_t r_etimer_2_div_en: 1;
            __IO uint32_t r_etimer_23_clk_src_sel2: 1;
            __IO uint32_t r_etimer_23_clk_src_sel1: 1;
            __IO uint32_t r_etimer_23_clk_src_sel0: 1;
            __IO uint32_t r_etimer_pwm_2_div_sel: 3;
            __IO uint32_t r_etimer_pwm_2_div_en: 1;
            __IO uint32_t r_etimer_pwm_2_clk_src_sel: 1;
            __IO uint32_t r_etimer_pwm_2_func_en: 1;
            __IO uint32_t r_etimer_pwm_2_ck_en: 1;
            __IO uint32_t RESERVED_2: 2;
            __IO uint32_t r_etimer_3_div_sel: 3;
            __IO uint32_t r_etimer_3_div_en: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t r_etimer_pwm_3_div_sel: 3;
            __IO uint32_t r_etimer_pwm_3_div_en: 1;
            __IO uint32_t r_etimer_pwm_3_clk_src_sel: 1;
            __IO uint32_t r_etimer_pwm_3_func_en: 1;
            __IO uint32_t r_etimer_pwm_3_ck_en: 1;
            __IO uint32_t RESERVED_0: 2;
        } BITS_348;
    } u_348;

    /* 0x34C        0x4000_234c
        7:0     R/W    GPIOA_G0_CNT_LIMIT              8'h1
        8       R/W    GPIOA_G0_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOA_G0_DEB_CLK_DIV            3'h0
        12      R/W    GPIOA_G0_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOA_G1_CNT_LIMIT              8'h1
        24      R/W    GPIOA_G1_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOA_G1_DEB_CLK_DIV            3'h0
        28      R/W    GPIOA_G1_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOA_DEB_CLK_CTL_0;
        struct
        {
            __IO uint32_t GPIOA_G0_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G0_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G0_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G0_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOA_G1_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G1_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G1_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G1_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_34C;
    } u_34C;

