rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0x350        0x4000_2350
        7:0     R/W    GPIOA_G2_CNT_LIMIT              8'h1
        8       R/W    GPIOA_G2_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOA_G2_DEB_CLK_DIV            3'h0
        12      R/W    GPIOA_G2_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOA_G3_CNT_LIMIT              8'h1
        24      R/W    GPIOA_G3_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOA_G3_DEB_CLK_DIV            3'h0
        28      R/W    GPIOA_G3_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOA_DEB_CLK_CTL_1;
        struct
        {
            __IO uint32_t GPIOA_G2_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G2_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G2_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G2_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOA_G3_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G3_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G3_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G3_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_350;
    } u_350;

    /* 0x354        0x4000_2354
        7:0     R/W    GPIOA_G4_CNT_LIMIT              8'h1
        8       R/W    GPIOA_G4_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOA_G4_DEB_CLK_DIV            3'h0
        12      R/W    GPIOA_G4_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOA_G5_CNT_LIMIT              8'h1
        24      R/W    GPIOA_G5_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOA_G5_DEB_CLK_DIV            3'h0
        28      R/W    GPIOA_G5_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOA_DEB_CLK_CTL_2;
        struct
        {
            __IO uint32_t GPIOA_G4_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G4_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G4_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G4_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOA_G5_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G5_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G5_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G5_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_354;
    } u_354;

    /* 0x358        0x4000_2358
        7:0     R/W    GPIOA_G6_CNT_LIMIT              8'h1
        8       R/W    GPIOA_G6_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOA_G6_DEB_CLK_DIV            3'h0
        12      R/W    GPIOA_G6_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOA_G7_CNT_LIMIT              8'h1
        24      R/W    GPIOA_G7_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOA_G7_DEB_CLK_DIV            3'h0
        28      R/W    GPIOA_G7_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOA_DEB_CLK_CTL_3;
        struct
        {
            __IO uint32_t GPIOA_G6_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G6_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G6_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G6_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOA_G7_CNT_LIMIT: 8;
            __IO uint32_t GPIOA_G7_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOA_G7_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOA_G7_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_358;
    } u_358;

    /* 0x35C        0x4000_235c
        31:0    R/W    GPIOA_x_DEB_FUNC_EN             32'h0
    */
    union
    {
        __IO uint32_t GPIOA_DEB_FUN_CTL;
        struct
        {
            __IO uint32_t GPIOA_x_DEB_FUNC_EN: 32;
        } BITS_35C;
    } u_35C;

    /* 0x360        0x4000_2360
        7:0     R/W    GPIOB_G0_CNT_LIMIT              8'h1
        8       R/W    GPIOB_G0_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOB_G0_DEB_CLK_DIV            3'h0
        12      R/W    GPIOB_G0_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOB_G1_CNT_LIMIT              8'h1
        24      R/W    GPIOB_G1_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOB_G1_DEB_CLK_DIV            3'h0
        28      R/W    GPIOB_G1_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOB_DEB_CLK_CTL_0;
        struct
        {
            __IO uint32_t GPIOB_G0_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G0_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G0_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G0_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOB_G1_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G1_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G1_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G1_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_360;
    } u_360;

    /* 0x364        0x4000_2364
        7:0     R/W    GPIOB_G2_CNT_LIMIT              8'h1
        8       R/W    GPIOB_G2_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOB_G2_DEB_CLK_DIV            3'h0
        12      R/W    GPIOB_G2_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOB_G3_CNT_LIMIT              8'h1
        24      R/W    GPIOB_G3_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOB_G3_DEB_CLK_DIV            3'h0
        28      R/W    GPIOB_G3_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOB_DEB_CLK_CTL_1;
        struct
        {
            __IO uint32_t GPIOB_G2_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G2_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G2_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G2_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOB_G3_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G3_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G3_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G3_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_364;
    } u_364;

