rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0x368        0x4000_2368
        7:0     R/W    GPIOB_G4_CNT_LIMIT              8'h1
        8       R/W    GPIOB_G4_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOB_G4_DEB_CLK_DIV            3'h0
        12      R/W    GPIOB_G4_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOB_G5_CNT_LIMIT              8'h1
        24      R/W    GPIOB_G5_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOB_G5_DEB_CLK_DIV            3'h0
        28      R/W    GPIOB_G5_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOB_DEB_CLK_CTL_2;
        struct
        {
            __IO uint32_t GPIOB_G4_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G4_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G4_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G4_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOB_G5_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G5_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G5_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G5_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_368;
    } u_368;

    /* 0x36C        0x4000_236c
        7:0     R/W    GPIOB_G6_CNT_LIMIT              8'h1
        8       R/W    GPIOB_G6_DEB_CLK_SEL            1'h0
        11:9    R/W    GPIOB_G6_DEB_CLK_DIV            3'h0
        12      R/W    GPIOB_G6_DEB_CNT_EN             1'b0
        15:13   R/W    RSVD                            3'h0
        23:16   R/W    GPIOB_G7_CNT_LIMIT              8'h1
        24      R/W    GPIOB_G7_DEB_CLK_SEL            1'h0
        27:25   R/W    GPIOB_G7_DEB_CLK_DIV            3'h0
        28      R/W    GPIOB_G7_DEB_CNT_EN             1'b0
        31:29   R/W    RSVD                            3'h0
    */
    union
    {
        __IO uint32_t GPIOB_DEB_CLK_CTL_3;
        struct
        {
            __IO uint32_t GPIOB_G6_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G6_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G6_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G6_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t GPIOB_G7_CNT_LIMIT: 8;
            __IO uint32_t GPIOB_G7_DEB_CLK_SEL: 1;
            __IO uint32_t GPIOB_G7_DEB_CLK_DIV: 3;
            __IO uint32_t GPIOB_G7_DEB_CNT_EN: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_36C;
    } u_36C;

    /* 0x370        0x4000_2370
        31:0    R/W    GPIOB_x_DEB_FUNC_EN             32'h0
    */
    union
    {
        __IO uint32_t GPIOB_DEB_FUN_CTL;
        struct
        {
            __IO uint32_t GPIOB_x_DEB_FUNC_EN: 32;
        } BITS_370;
    } u_370;

    /* 0x374        0x4000_2374
        0       R/W    sdio_ck_en                      1'h0
        1       R/W    sdio_func_en                    1'h0
        2       R/W    r_sdio_clk_src_en               1'h0
        6:3     R/W    r_sdio_div_sel                  4'h0
        7       R/W    r_sdio_div_en                   1'h0
        8       R/W    r_sdio_mux_clk_cg_en            1'h0
        9       R/W    r_sdio_clk_src_sel1             1'h0
        10      R/W    r_sdio_clk_src_sel0             1'h0
        31:11   R/W    RSVD                            21'h0
    */
    union
    {
        __IO uint32_t REG_SDH_CTL;
        struct
        {
            __IO uint32_t sdio_ck_en: 1;
            __IO uint32_t sdio_func_en: 1;
            __IO uint32_t r_sdio_clk_src_en: 1;
            __IO uint32_t r_sdio_div_sel: 4;
            __IO uint32_t r_sdio_div_en: 1;
            __IO uint32_t r_sdio_mux_clk_cg_en: 1;
            __IO uint32_t r_sdio_clk_src_sel1: 1;
            __IO uint32_t r_sdio_clk_src_sel0: 1;
            __IO uint32_t RESERVED_0: 21;
        } BITS_374;
    } u_374;

    /* 0x378        0x4000_2378
        7:0     R/W    r_sdh_drv_dly_sel               8'h0
        15:8    R/W    r_sdh_sample_dly_sel            8'h0
        17:16   R/W    r_sdh_clk_sel_drv               2'h0
        19:18   R/W    r_sdh_clk_sel_sample            2'h0
        20      R/W    r_sdh_bypass_shift_drv          1'h0
        21      R/W    r_sdh_bypass_shift_sample       1'h0
        22      R/W    r_sdh_bypass_delay_drv          1'h0
        23      R/W    r_sdh_bypass_delay_sample       1'h0
        31:24   R/W    r_sdh_clk_out_dly_sel           8'h0
    */
    union
    {
        __IO uint32_t REG_SDH_PHY0;
        struct
        {
            __IO uint32_t r_sdh_drv_dly_sel: 8;
            __IO uint32_t r_sdh_sample_dly_sel: 8;
            __IO uint32_t r_sdh_clk_sel_drv: 2;
            __IO uint32_t r_sdh_clk_sel_sample: 2;
            __IO uint32_t r_sdh_bypass_shift_drv: 1;
            __IO uint32_t r_sdh_bypass_shift_sample: 1;
            __IO uint32_t r_sdh_bypass_delay_drv: 1;
            __IO uint32_t r_sdh_bypass_delay_sample: 1;
            __IO uint32_t r_sdh_clk_out_dly_sel: 8;
        } BITS_378;
    } u_378;

    /* 0x37C        0x4000_237c
        7:0     R/W    r_sdh_cmd_out_dly_sel           8'h0
        15:8    R/W    r_sdh_dat0_dly_sel              8'h0
        23:16   R/W    r_sdh_dat1_dly_sel              8'h0
        31:24   R/W    r_sdh_dat2_dly_sel              8'h0
    */
    union
    {
        __IO uint32_t REG_SDH_PHY1;
        struct
        {
            __IO uint32_t r_sdh_cmd_out_dly_sel: 8;
            __IO uint32_t r_sdh_dat0_dly_sel: 8;
            __IO uint32_t r_sdh_dat1_dly_sel: 8;
            __IO uint32_t r_sdh_dat2_dly_sel: 8;
        } BITS_37C;
    } u_37C;

    /* 0x380        0x4000_2380
        7:0     R/W    r_sdh_dat3_dly_sel              8'h0
        15:8    R/W    r_sdh_dat4_dly_sel              8'h0
        23:16   R/W    r_sdh_dat5_dly_sel              8'h0
        31:24   R/W    r_sdh_dat6_dly_sel              8'h0
    */
    union
    {
        __IO uint32_t REG_SDH_PHY2;
        struct
        {
            __IO uint32_t r_sdh_dat3_dly_sel: 8;
            __IO uint32_t r_sdh_dat4_dly_sel: 8;
            __IO uint32_t r_sdh_dat5_dly_sel: 8;
            __IO uint32_t r_sdh_dat6_dly_sel: 8;
        } BITS_380;
    } u_380;

    /* 0x384        0x4000_2384
        7:0     R/W    r_sdh_dat7_dly_sel              8'h0
        19:8    R/W    r_sdh_dbg_sel                   12'h0
        21:20   R/W    r_sdh_dbg_en_i                  2'h0
        22      R/W    r_sdh_cclk_in_drv               1'h0
        23      R/W    r_sdh_cclk_sample_drv           1'h0
        24      R/W    r_sdh_cclk_in_div_enable        1'h1
        31:25   R/W    RSVD                            7'h0
    */
    union
    {
        __IO uint32_t REG_SDH_PHY3;
        struct
        {
            __IO uint32_t r_sdh_dat7_dly_sel: 8;
            __IO uint32_t r_sdh_dbg_sel: 12;
            __IO uint32_t r_sdh_dbg_en_i: 2;
            __IO uint32_t r_sdh_cclk_in_drv: 1;
            __IO uint32_t r_sdh_cclk_sample_drv: 1;
            __IO uint32_t r_sdh_cclk_in_div_enable: 1;
            __IO uint32_t RESERVED_0: 7;
        } BITS_384;
    } u_384;

    /* 0x388        0x4000_2388
        5:0     R/W    r_bt_ahb_wait_cnt               6'hC
        31:6    R/W    RSVD                            26'h0
    */
    union
    {
        __IO uint32_t REG_BT_MISC;
        struct
        {
            __IO uint32_t r_bt_ahb_wait_cnt: 6;
            __IO uint32_t RESERVED_0: 26;
        } BITS_388;
    } u_388;

    /* 0x38C        0x4000_238c
        0       R/W    r_PMUX_1_WIRE_UART4_EN          1'h0
        1       R/W    rtk_uart4_func_en               1'h0
        2       R/W    rtk_uart4_ck_en                 1'h0
        3       R/W    rtk_uart4_div_en                1'h0
        6:4     R/W    rtk_uart4_div_sel               3'b000
        7       R/W    RSVD                            1'h0
        8       R/W    r_PMUX_1_WIRE_UART5_EN          1'h0
        9       R/W    rtk_uart5_func_en               1'h0
        10      R/W    rtk_uart5_ck_en                 1'h0
        11      R/W    rtk_uart5_div_en                1'h0
        14:12   R/W    rtk_uart5_div_sel               3'b000
        31:15   R/W    RSVD                            17'h0
    */
    union
    {
        __IO uint32_t REG_UART_PERI_CTL1;
        struct
        {
            __IO uint32_t r_PMUX_1_WIRE_UART4_EN: 1;
            __IO uint32_t rtk_uart4_func_en: 1;
            __IO uint32_t rtk_uart4_ck_en: 1;
            __IO uint32_t rtk_uart4_div_en: 1;
            __IO uint32_t rtk_uart4_div_sel: 3;
            __IO uint32_t RESERVED_13: 1;
            __IO uint32_t r_PMUX_1_WIRE_UART5_EN: 1;
            __IO uint32_t rtk_uart5_func_en: 1;
            __IO uint32_t rtk_uart5_ck_en: 1;
            __IO uint32_t rtk_uart5_div_en: 1;
            __IO uint32_t rtk_uart5_div_sel: 3;
            __IO uint32_t RESERVED_0: 17;
        } BITS_38C;
    } u_38C;

    /* 0x390        0x4000_2390
        1:0     R/W    GMAC_LX_BUS_TIMEOUT_THRESHOLD   2'h0
        2       R/W    GMAC_LX_BUS_TIMEOUT_EN          1'h0
        3       R/W    GMAC_LX_BUS_DMA_LOCK_IN         1'h0
        5:4     R/W    GMAC_MII_LX_TIMEOUT_THRESHOLD   2'h0
        6       R/W    GMAC_MII_LX_TIMEOUT_EN          1'h0
        31:7    R/W    RSVD                            25'b0
    */
    union
    {
        __IO uint32_t REG_GMAC_BUS;
        struct
        {
            __IO uint32_t GMAC_LX_BUS_TIMEOUT_THRESHOLD: 2;
            __IO uint32_t GMAC_LX_BUS_TIMEOUT_EN: 1;
            __IO uint32_t GMAC_LX_BUS_DMA_LOCK_IN: 1;
            __IO uint32_t GMAC_MII_LX_TIMEOUT_THRESHOLD: 2;
            __IO uint32_t GMAC_MII_LX_TIMEOUT_EN: 1;
            __IO uint32_t RESERVED_0: 25;
        } BITS_390;
    } u_390;

    /* 0x394        0x4000_2394
        18:0    R/W    gmac_base_addr                  19'h20020
        31:19   R/W    RSVD                            13'b0
    */
    union
    {
        __IO uint32_t REG_GMAC_BASE_ADDR;
        struct
        {
            __IO uint32_t gmac_base_addr: 19;
            __IO uint32_t RESERVED_0: 13;
        } BITS_394;
    } u_394;

    /* 0x398        0x4000_2398
        18:0    R/W    gmac_base_addr_1                19'h28020
        31:19   R/W    RSVD                            13'b0
    */
    union
    {
        __IO uint32_t REG_GMAC_BASE_ADDR_1;
        struct
        {
            __IO uint32_t gmac_base_addr_1: 19;
            __IO uint32_t RESERVED_0: 13;
        } BITS_398;
    } u_398;

    /* 0x39C        0x4000_239c
        5:0     R/W    gmac2fephy_phy_ad               6'b0
        31:6    R/W    RSVD                            26'b0
    */
    union
    {
        __IO uint32_t REG_GMAC_PHY_AD;
        struct
        {
            __IO uint32_t gmac2fephy_phy_ad: 6;
            __IO uint32_t RESERVED_0: 26;
        } BITS_39C;
    } u_39C;

    /* 0x3A0        0x4000_23a0
        31:0    R/W    r_sdh0_phy_dbg                  32'h0
    */
    union
    {
        __IO uint32_t REG_SDH0_DBG0;
        struct
        {
            __IO uint32_t r_sdh0_phy_dbg: 32;
        } BITS_3A0;
    } u_3A0;

    /* 0x3A4        0x4000_23a4
        31:0    R/W    r_sdh0_dbg                      32'h0
    */
    union
    {
        __IO uint32_t REG_SDH0_DBG1;
        struct
        {
            __IO uint32_t r_sdh0_dbg: 32;
        } BITS_3A4;
    } u_3A4;

    /* 0x3A8        0x4000_23a8
        7:0     R/W    r_sdh0_cmd_out_oe_dly_sel       8'h0
        15:8    R/W    r_sdh0_dat0_oe_dly_sel          8'h0
        23:16   R/W    r_sdh0_dat1_oe_dly_sel          8'h0
        31:24   R/W    r_sdh0_dat2_oe_dly_sel          8'h0
    */
    union
    {
        __IO uint32_t REG_SDH0_PHY4;
        struct
        {
            __IO uint32_t r_sdh0_cmd_out_oe_dly_sel: 8;
            __IO uint32_t r_sdh0_dat0_oe_dly_sel: 8;
            __IO uint32_t r_sdh0_dat1_oe_dly_sel: 8;
            __IO uint32_t r_sdh0_dat2_oe_dly_sel: 8;
        } BITS_3A8;
    } u_3A8;

    /* 0x3AC        0x4000_23ac
        7:0     R/W    r_sdh0_dat3_oe_dly_sel          8'h0
        15:8    R/W    r_sdh0_dat4_oe_dly_sel          8'h0
        23:16   R/W    r_sdh0_dat5_oe_dly_sel          8'h0
        31:24   R/W    r_sdh0_dat6_oe_dly_sel          8'h0
    */
    union
    {
        __IO uint32_t REG_SDIO0_PHY5;
        struct
        {
            __IO uint32_t r_sdh0_dat3_oe_dly_sel: 8;
            __IO uint32_t r_sdh0_dat4_oe_dly_sel: 8;
            __IO uint32_t r_sdh0_dat5_oe_dly_sel: 8;
            __IO uint32_t r_sdh0_dat6_oe_dly_sel: 8;
        } BITS_3AC;
    } u_3AC;

    /* 0x3B0        0x4000_23b0
        7:0     R/W    r_sdh0_dat7_oe_dly_sel          8'h0
        15:8    R/W    RSVD                            8'h0
        23:16   R/W    RSVD                            8'h0
        31:24   R/W    RSVD                            8'h0
    */
    union
    {
        __IO uint32_t REG_SDH0_PHY8;
        struct
        {
            __IO uint32_t r_sdh0_dat7_oe_dly_sel: 8;
            __IO uint32_t RESERVED_2: 8;
            __IO uint32_t RESERVED_1: 8;
            __IO uint32_t RESERVED_0: 8;
        } BITS_3B0;
    } u_3B0;

    /* 0x3B4        0x4000_23b4
        31:0    R/W    sdh_dummy_reg_1                 32'h0
    */
    union
    {
        __IO uint32_t SDIO_DUMMY_REG1;
        struct
        {
            __IO uint32_t sdh_dummy_reg_1: 32;
        } BITS_3B4;
    } u_3B4;

    /* 0x3B8        0x4000_23b8
        31:0    R/W    sdh_dummy_reg_2                 32'h0
    */
    union
    {
        __IO uint32_t SDIO_DUMMY_REG2;
        struct
        {
            __IO uint32_t sdh_dummy_reg_2: 32;
        } BITS_3B8;
    } u_3B8;

    /* 0x3BC        0x4000_23bc
        31:0    R/W    sdh_dummy_reg_3                 32'h0
    */
    union
    {
        __IO uint32_t SDIO_DUMMY_REG3;
        struct
        {
            __IO uint32_t sdh_dummy_reg_3: 32;
        } BITS_3BC;
    } u_3BC;

    /* 0x3C0        0x4000_23c0
        31:0    R/W    sdh_dummy_reg_4                 32'h0
    */
    union
    {
        __IO uint32_t SDIO_DUMMY_REG4;
        struct
        {
            __IO uint32_t sdh_dummy_reg_4: 32;
        } BITS_3C0;
    } u_3C0;

} PERI_BLKCTRL_PERI_CLK_TypeDef;

/* reference: Bee4_PERI-ON_20221017_v2.xlsx */
typedef struct
{
    /* 0x700        0x4000_2700
        0       R/W    sport0_func_en          1'h0
        1       R/W    sport0_ck_en            1'h0
        2       R/W    sport1_func_en          1'h0
        3       R/W    sport1_ck_en            1'h0
        4       R/W    RSVD                    1'h0
        5       R/W    RSVD                    1'h0
        6       R/W    RSVD                    1'h0
        7       R/W    RSVD                    1'h0
        8       R/W    audio_func_en           1'h0
        9       R/W    audio_ck_en             1'h0
        10      R/W    r_CLK_EN_SPORT_40M      1'h0
        13:11   R/W    sp0_dsp_clk_sel         3'h0
        14      R/W    RSVD                    1'h0
        17:15   R/W    sp1_dsp_clk_sel         3'h0
        18      R/W    RSVD                    1'h0
        21:19   R/W    RSVD                    3'h0
        22      R/W    RSVD                    1'h0
        25:23   R/W    RSVD                    3'h0
        26      R/W    RSVD                    1'h0
        27      R/W    RSVD                    1'h0
        28      R/W    r_sport_pll2_ck_en      1'h0
        31:29   R/W    RSVD                    3'h0
    */
    union
    {
        __IO uint32_t REG_SOC_AUDIO_IF_EN;
        struct
        {
            __IO uint32_t sport0_func_en: 1;
            __IO uint32_t sport0_ck_en: 1;
            __IO uint32_t sport1_func_en: 1;
            __IO uint32_t sport1_ck_en: 1;
            __IO uint32_t RESERVED_11: 1;
            __IO uint32_t RESERVED_10: 1;
            __IO uint32_t RESERVED_9: 1;
            __IO uint32_t RESERVED_8: 1;
            __IO uint32_t audio_func_en: 1;
            __IO uint32_t audio_ck_en: 1;
            __IO uint32_t r_CLK_EN_SPORT_40M: 1;
            __IO uint32_t sp0_dsp_clk_sel: 3;
            __IO uint32_t RESERVED_7: 1;
            __IO uint32_t sp1_dsp_clk_sel: 3;
            __IO uint32_t RESERVED_6: 1;
            __IO uint32_t RESERVED_5: 3;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 3;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t r_sport_pll2_ck_en: 1;
            __IO uint32_t RESERVED_0: 3;
        } BITS_700;
    } u_700;

