rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0x704        0x4000_2704
        7:0     R/W    r_PLL_DIV0_SETTING      8'h0
        15:8    R/W    r_PLL_DIV1_SETTING      8'h0
        23:16   R/W    RSVD                    8'h0
        31:24   R/W    RSVD                    8'h0
    */
    union
    {
        __IO uint32_t REG_AUDIO_PERI_CTL0;
        struct
        {
            __IO uint32_t r_PLL_DIV0_SETTING: 8;
            __IO uint32_t r_PLL_DIV1_SETTING: 8;
            __IO uint32_t RESERVED_1: 8;
            __IO uint32_t RESERVED_0: 8;
        } BITS_704;
    } u_704;

    /* 0x708        0x4000_2708
        0       R/W    r_CODEC_i2s0_master_sel 1'h0
        1       R/W    r_CODEC_i2s1_master_sel 1'h0
        2       R/W    RSVD                    1'h0
        3       R/W    RSVD                    1'h0
        4       R/W    r_SPORT0_EXT_CODEC      1'h0
        5       R/W    r_SPORT1_EXT_CODEC      1'h0
        6       R/W    RSVD                    1'h0
        7       R/W    RSVD                    1'h0
        8       R/W    r_SPORT0_MCLK_OUT       1'h0
        9       R/W    r_SPORT1_MCLK_OUT       1'h0
        10      R/W    RSVD                    1'h0
        11      R/W    RSVD                    1'h0
        31:12   R/W    RSVD                    20'h0
    */
    union
    {
        __IO uint32_t REG_AUDIO_PERI_CTL1;
        struct
        {
            __IO uint32_t r_CODEC_i2s0_master_sel: 1;
            __IO uint32_t r_CODEC_i2s1_master_sel: 1;
            __IO uint32_t RESERVED_6: 1;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t r_SPORT0_EXT_CODEC: 1;
            __IO uint32_t r_SPORT1_EXT_CODEC: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t r_SPORT0_MCLK_OUT: 1;
            __IO uint32_t r_SPORT1_MCLK_OUT: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 20;
        } BITS_708;
    } u_708;

    /* 0x70C        0x4000_270c
        0       R/W    mclk2_en                1'h0
        1       R/W    mclk2_out_sel           1'h0
        3:2     R/W    RSVD                    2'h0
        4       R/W    mclk2_src_sel_0         2'h0
        5       R/W    mclk2_src_sel_1         2'h0
        7:6     R/W    RSVD                    2'h0
        15:8    R/W    mclk2_div_setting       8'h0
        16      R/W    mclk2_pmux_sel          1'h0
        31:17   R/W    RSVD                    15'h0
    */
    union
    {
        __IO uint32_t REG_AUDIO_PERI_CTL2;
        struct
        {
            __IO uint32_t mclk2_en: 1;
            __IO uint32_t mclk2_out_sel: 1;
            __IO uint32_t RESERVED_2: 2;
            __IO uint32_t mclk2_src_sel_0: 1;
            __IO uint32_t mclk2_src_sel_1: 1;
            __IO uint32_t RESERVED_1: 2;
            __IO uint32_t mclk2_div_setting: 8;
            __IO uint32_t mclk2_pmux_sel: 1;
            __IO uint32_t RESERVED_0: 15;
        } BITS_70C;
    } u_70C;

} PERIBLKCTRL_AUDIO_TypeDef;

/* reference: Bee4_PERI-ON_20221017_v2.xlsx */
typedef struct
{
    /* 0xA00        0x4000_2a00
        31:0    R      RSVD                        32'h0
    */
    __IO uint32_t REG_MISC6;

    /* 0xA04        0x4000_2a04
        1:0     R/W    DEBUG_G0_bit                2'h0
        7:2     R/W    DEBUG_G0_INDEX              6'h0
        9:8     R/W    DEBUG_G1_bit                2'h0
        15:10   R/W    DEBUG_G1_INDEX              6'h0
        17:16   R/W    DEBUG_G2_bit                2'h0
        23:18   R/W    DEBUG_G2_INDEX              8'h0
        25:24   R/W    DEBUG_G3_bit                2'h0
        31:26   R/W    DEBUG_G3_INDEX              6'h0
    */
    union
    {
        __IO uint32_t REG_MISC7;
        struct
        {
            __IO uint32_t DEBUG_G0_bit: 2;
            __IO uint32_t DEBUG_G0_INDEX: 6;
            __IO uint32_t DEBUG_G1_bit: 2;
            __IO uint32_t DEBUG_G1_INDEX: 6;
            __IO uint32_t DEBUG_G2_bit: 2;
            __IO uint32_t DEBUG_G2_INDEX: 6;
            __IO uint32_t DEBUG_G3_bit: 2;
            __IO uint32_t DEBUG_G3_INDEX: 6;
        } BITS_A04;
    } u_A04;

    /* 0xA08        0x4000_2a08
        2:0     R/W    DBG_P0_SEL3_0               3'h0
        5:3     R/W    DBG_P0_SEL7_4               3'h0
        8:6     R/W    DBG_P1_SEL3_0               3'h0
        11:9    R/W    DBG_P1_SEL7_4               3'h0
        14:12   R/W    DBG_P2_SEL3_0               3'h0
        17:15   R/W    DBG_P2_SEL7_4               3'h0
        20:18   R/W    DBG_P3_SEL3_0               3'h0
        23:21   R/W    DBG_P3_SEL7_4               3'h0
        26:24   R/W    DBG_P4_SEL3_0               3'h0
        29:27   R/W    DBG_P4_SEL7_4               3'h0
        31:30   R/W    RSVD                        2'h0
    */
    union
    {
        __IO uint32_t REG_MISC8;
        struct
        {
            __IO uint32_t DBG_P0_SEL3_0: 3;
            __IO uint32_t DBG_P0_SEL7_4: 3;
            __IO uint32_t DBG_P1_SEL3_0: 3;
            __IO uint32_t DBG_P1_SEL7_4: 3;
            __IO uint32_t DBG_P2_SEL3_0: 3;
            __IO uint32_t DBG_P2_SEL7_4: 3;
            __IO uint32_t DBG_P3_SEL3_0: 3;
            __IO uint32_t DBG_P3_SEL7_4: 3;
            __IO uint32_t DBG_P4_SEL3_0: 3;
            __IO uint32_t DBG_P4_SEL7_4: 3;
            __IO uint32_t RESERVED_0: 2;
        } BITS_A08;
    } u_A08;

    /* 0xA0C        0x4000_2a0c
        2:0     R/W    DBG_P5_SEL3_0               3'h0
        5:3     R/W    DBG_P5_SEL7_4               3'h0
        8:6     R/W    RSVD                        3'h0
        11:9    R/W    RSVD                        3'h0
        14:12   R/W    RSVD                        3'h0
        17:15   R/W    RSVD                        3'h0
        20:18   R/W    DBG_P8_SEL3_0               3'h0
        23:21   R/W    RSVD                        3'h0
        26:24   R/W    DBG_P9_SEL3_0               3'h0
        29:27   R/W    DBG_P9_SEL7_4               3'h0
        31:30   R/W    RSVD                        2'h0
    */
    union
    {
        __IO uint32_t REG_MISC9;
        struct
        {
            __IO uint32_t DBG_P5_SEL3_0: 3;
            __IO uint32_t DBG_P5_SEL7_4: 3;
            __IO uint32_t RESERVED_5: 3;
            __IO uint32_t RESERVED_4: 3;
            __IO uint32_t RESERVED_3: 3;
            __IO uint32_t RESERVED_2: 3;
            __IO uint32_t DBG_P8_SEL3_0: 3;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t DBG_P9_SEL3_0: 3;
            __IO uint32_t DBG_P9_SEL7_4: 3;
            __IO uint32_t RESERVED_0: 2;
        } BITS_A0C;
    } u_A0C;

