rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0xA10        0x4000_2a10
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_MISC10;

    /* 0xA14        0x4000_2a14
        31:0    R      RSVD                        32'b0
    */
    __IO uint32_t REG_MISC11;

    /* 0xA18        0x4000_2a18
        7:0     R/W    PMUX_TEST_MODE_SEL          8'h0
        31:8    R/W    RSVD                        24'h0
    */
    union
    {
        __IO uint32_t TESTMODE_SEL_VCORE2;
        struct
        {
            __IO uint32_t PMUX_TEST_MODE_SEL: 8;
            __IO uint32_t RESERVED_0: 24;
        } BITS_A18;
    } u_A18;

    /* 0xA1C        0x4000_2a1c
        7:0     R/W    DIG_DEBUG_MODE_SEL          8'h0
        11:8    R/W    SPIC_MON_SEL                4'h0
        31:12   R/W    RSVD                        20'h0
    */
    union
    {
        __IO uint32_t DIG_DEBUG_SEL_VCORE2;
        struct
        {
            __IO uint32_t DIG_DEBUG_MODE_SEL: 8;
            __IO uint32_t SPIC_MON_SEL: 4;
            __IO uint32_t RESERVED_0: 20;
        } BITS_A1C;
    } u_A1C;

    /* 0xA20        0x4000_2a20
        0       R/W    FLASH_FT_MODE_EN            1'b0
        1       R/W    FLASH_MP_MODE_EN            1'b0
        31:2    R/W    RSVD                        30'h0
    */
    union
    {
        __IO uint32_t FLASH_FT_MP_MODE;
        struct
        {
            __IO uint32_t FLASH_FT_MODE_EN: 1;
            __IO uint32_t FLASH_MP_MODE_EN: 1;
            __IO uint32_t RESERVED_0: 30;
        } BITS_A20;
    } u_A20;

    /* 0xA24        0x4000_2a24
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t KM4_TRACE_DLY;

    /* 0xA28        0x4000_2a28
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_1;

    /* 0xA2C        0x4000_2a2c
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_2;

    /* 0xA30        0x4000_2a30
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_3;

    /* 0xA34        0x4000_2a34
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_4;

    /* 0xA38        0x4000_2a38
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_5;

    /* 0xA3C        0x4000_2a3c
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_6;

    /* 0xA40        0x4000_2a40
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_7;

    /* 0xA44        0x4000_2a44
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_8;

    /* 0xA48        0x4000_2a48
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_9;

    /* 0xA4C        0x4000_2a4c
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_10;

    /* 0xA50        0x4000_2a50
        31:0    R/W    RSVD                        32'h0
    */
    __IO uint32_t REG_SDIO_MBIST_CTRL_11;

    /* 0xA54        0x4000_2a54
        28:0    R/W    RSVD                        29'h0
        29      R/W    reg_aon_w1o_spic0_ft_dis    1'b0
        30      R/W    reg_aon_w1o_spic0_mp_dis    1'b0
        31      R/W    reg_aon_w1o_spic0_dbg_dis   1'b0
    */
    union
    {
        __IO uint32_t REG_FLASH_DBG;
        struct
        {
            __IO uint32_t RESERVED_0: 29;
            __IO uint32_t reg_aon_w1o_spic0_ft_dis: 1;
            __IO uint32_t reg_aon_w1o_spic0_mp_dis: 1;
            __IO uint32_t reg_aon_w1o_spic0_dbg_dis: 1;
        } BITS_A54;
    } u_A54;
} PERI_BLKCTRL_INTERNAL_AUTO_TypeDef;

typedef struct
{
    /* 0xB00        0x4000_2b00
        2:0     R/W    rf_0_remap_table            3'b0
        3       R      RSVD                        1'b0
        6:4     R/W    rf_4_remap_table            3'b001
        7       R      RSVD                        1'b0
        10:8    R/W    rf_5_remap_table            3'b010
        11      R      RSVD                        1'b0
        14:12   R/W    rf_6_remap_table            3'b011
        15      R      RSVD                        1'b0
        18:16   R/W    rf_7_remap_table            3'b100
        30:19   R      RSVD                        12'b0
        31      R/W    auto_switch_update          1'b0
    */
    union
    {
        __IO uint32_t REG_AUTO_TABLE_MAP;
        struct
        {
            __IO uint32_t rf_0_remap_table: 3;
            __I uint32_t RESERVED_4: 1;
            __IO uint32_t rf_4_remap_table: 3;
            __I uint32_t RESERVED_3: 1;
            __IO uint32_t rf_5_remap_table: 3;
            __I uint32_t RESERVED_2: 1;
            __IO uint32_t rf_6_remap_table: 3;
            __I uint32_t RESERVED_1: 1;
            __IO uint32_t rf_7_remap_table: 3;
            __I uint32_t RESERVED_0: 12;
            __IO uint32_t auto_switch_update: 1;
        } BITS_B00;
    } u_B00;

    /* 0xB04        0x4000_2b04
        0       R/W    CORE_BUCK_FPWM_H            1'b1
        1       RW     CORE_BUCK_PFM_AOT_EN        1'b0
        2       RW     CORE_BUCK_PFM_COT_EN        1'b1
        3       RW     CORE_BUCK_ENOFFSAWPFM_H     1'b1
        5:4     R/W    CORE_BUCK_OCPRES_H          2'b01
        8:6     R/W    CORE_BUCK_VREFOCP_H         3'b001
        14:9    R/W    CORE_BUCK_SWRTUNE_H         6'b011101
        18:15   R/W    CORE_BUCK_VREFPFM_H         4'b1011
        24:19   RW     CORE_D300k_REG_MANU_CCOT    6'b010000
        25      R/W    CORE_LDO_ENPC_LDODIGI       1'b0
        31:26   R/W    CORE_BUCK_LDOTUNE_H         6'b0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW0_0;
        struct
        {
            __IO uint32_t CORE_BUCK_FPWM_H: 1;
            __IO uint32_t CORE_BUCK_PFM_AOT_EN: 1;
            __IO uint32_t CORE_BUCK_PFM_COT_EN: 1;
            __IO uint32_t CORE_BUCK_ENOFFSAWPFM_H: 1;
            __IO uint32_t CORE_BUCK_OCPRES_H: 2;
            __IO uint32_t CORE_BUCK_VREFOCP_H: 3;
            __IO uint32_t CORE_BUCK_SWRTUNE_H: 6;
            __IO uint32_t CORE_BUCK_VREFPFM_H: 4;
            __IO uint32_t CORE_D300k_REG_MANU_CCOT: 6;
            __IO uint32_t CORE_LDO_ENPC_LDODIGI: 1;
            __IO uint32_t CORE_BUCK_LDOTUNE_H: 6;
        } BITS_B04;
    } u_B04;

    /* 0xB08        0x4000_2b08
        0       R/W    CORE_BUCK_FPWM_H            1'b1
        1       RW     CORE_BUCK_PFM_AOT_EN        1'b0
        2       RW     CORE_BUCK_PFM_COT_EN        1'b1
        3       RW     CORE_BUCK_ENOFFSAWPFM_H     1'b1
        5:4     R/W    CORE_BUCK_OCPRES_H          2'b01
        8:6     R/W    CORE_BUCK_VREFOCP_H         3'b001
        14:9    R/W    CORE_BUCK_SWRTUNE_H         6'b011101
        18:15   R/W    CORE_BUCK_VREFPFM_H         4'b1011
        24:19   RW     CORE_D300k_REG_MANU_CCOT    6'b010000
        25      R/W    CORE_LDO_ENPC_LDODIGI       1'b0
        31:26   R/W    CORE_BUCK_LDOTUNE_H         6'b0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW4_0;
        struct
        {
            __IO uint32_t CORE_BUCK_FPWM_H: 1;
            __IO uint32_t CORE_BUCK_PFM_AOT_EN: 1;
            __IO uint32_t CORE_BUCK_PFM_COT_EN: 1;
            __IO uint32_t CORE_BUCK_ENOFFSAWPFM_H: 1;
            __IO uint32_t CORE_BUCK_OCPRES_H: 2;
            __IO uint32_t CORE_BUCK_VREFOCP_H: 3;
            __IO uint32_t CORE_BUCK_SWRTUNE_H: 6;
            __IO uint32_t CORE_BUCK_VREFPFM_H: 4;
            __IO uint32_t CORE_D300k_REG_MANU_CCOT: 6;
            __IO uint32_t CORE_LDO_ENPC_LDODIGI: 1;
            __IO uint32_t CORE_BUCK_LDOTUNE_H: 6;
        } BITS_B08;
    } u_B08;

    /* 0xB0C        0x4000_2b0c
        0       R/W    CORE_BUCK_FPWM_H            1'b1
        1       RW     CORE_BUCK_PFM_AOT_EN        1'b0
        2       RW     CORE_BUCK_PFM_COT_EN        1'b1
        3       RW     CORE_BUCK_ENOFFSAWPFM_H     1'b1
        5:4     R/W    CORE_BUCK_OCPRES_H          2'b01
        8:6     R/W    CORE_BUCK_VREFOCP_H         3'b001
        14:9    R/W    CORE_BUCK_SWRTUNE_H         6'b011101
        18:15   R/W    CORE_BUCK_VREFPFM_H         4'b1011
        24:19   RW     CORE_D300k_REG_MANU_CCOT    6'b010000
        25      R/W    CORE_LDO_ENPC_LDODIGI       1'b0
        31:26   R/W    CORE_BUCK_LDOTUNE_H         6'b0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW5_0;
        struct
        {
            __IO uint32_t CORE_BUCK_FPWM_H: 1;
            __IO uint32_t CORE_BUCK_PFM_AOT_EN: 1;
            __IO uint32_t CORE_BUCK_PFM_COT_EN: 1;
            __IO uint32_t CORE_BUCK_ENOFFSAWPFM_H: 1;
            __IO uint32_t CORE_BUCK_OCPRES_H: 2;
            __IO uint32_t CORE_BUCK_VREFOCP_H: 3;
            __IO uint32_t CORE_BUCK_SWRTUNE_H: 6;
            __IO uint32_t CORE_BUCK_VREFPFM_H: 4;
            __IO uint32_t CORE_D300k_REG_MANU_CCOT: 6;
            __IO uint32_t CORE_LDO_ENPC_LDODIGI: 1;
            __IO uint32_t CORE_BUCK_LDOTUNE_H: 6;
        } BITS_B0C;
    } u_B0C;

    /* 0xB10        0x4000_2b10
        0       R/W    CORE_BUCK_FPWM_H            1'b1
        1       RW     CORE_BUCK_PFM_AOT_EN        1'b0
        2       RW     CORE_BUCK_PFM_COT_EN        1'b1
        3       RW     CORE_BUCK_ENOFFSAWPFM_H     1'b1
        5:4     R/W    CORE_BUCK_OCPRES_H          2'b01
        8:6     R/W    CORE_BUCK_VREFOCP_H         3'b001
        14:9    R/W    CORE_BUCK_SWRTUNE_H         6'b011101
        18:15   R/W    CORE_BUCK_VREFPFM_H         4'b1011
        24:19   RW     CORE_D300k_REG_MANU_CCOT    6'b010000
        25      R/W    CORE_LDO_ENPC_LDODIGI       1'b0
        31:26   R/W    CORE_BUCK_LDOTUNE_H         6'b0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW6_0;
        struct
        {
            __IO uint32_t CORE_BUCK_FPWM_H: 1;
            __IO uint32_t CORE_BUCK_PFM_AOT_EN: 1;
            __IO uint32_t CORE_BUCK_PFM_COT_EN: 1;
            __IO uint32_t CORE_BUCK_ENOFFSAWPFM_H: 1;
            __IO uint32_t CORE_BUCK_OCPRES_H: 2;
            __IO uint32_t CORE_BUCK_VREFOCP_H: 3;
            __IO uint32_t CORE_BUCK_SWRTUNE_H: 6;
            __IO uint32_t CORE_BUCK_VREFPFM_H: 4;
            __IO uint32_t CORE_D300k_REG_MANU_CCOT: 6;
            __IO uint32_t CORE_LDO_ENPC_LDODIGI: 1;
            __IO uint32_t CORE_BUCK_LDOTUNE_H: 6;
        } BITS_B10;
    } u_B10;

    /* 0xB14        0x4000_2b14
        0       R/W    CORE_BUCK_FPWM_H            1'b1
        1       RW     CORE_BUCK_PFM_AOT_EN        1'b0
        2       RW     CORE_BUCK_PFM_COT_EN        1'b1
        3       RW     CORE_BUCK_ENOFFSAWPFM_H     1'b1
        5:4     R/W    CORE_BUCK_OCPRES_H          2'b01
        8:6     R/W    CORE_BUCK_VREFOCP_H         3'b001
        14:9    R/W    CORE_BUCK_SWRTUNE_H         6'b011101
        18:15   R/W    CORE_BUCK_VREFPFM_H         4'b1011
        24:19   RW     CORE_D300k_REG_MANU_CCOT    6'b010000
        25      R/W    CORE_LDO_ENPC_LDODIGI       1'b0
        31:26   R/W    CORE_BUCK_LDOTUNE_H         6'b0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW7_0;
        struct
        {
            __IO uint32_t CORE_BUCK_FPWM_H: 1;
            __IO uint32_t CORE_BUCK_PFM_AOT_EN: 1;
            __IO uint32_t CORE_BUCK_PFM_COT_EN: 1;
            __IO uint32_t CORE_BUCK_ENOFFSAWPFM_H: 1;
            __IO uint32_t CORE_BUCK_OCPRES_H: 2;
            __IO uint32_t CORE_BUCK_VREFOCP_H: 3;
            __IO uint32_t CORE_BUCK_SWRTUNE_H: 6;
            __IO uint32_t CORE_BUCK_VREFPFM_H: 4;
            __IO uint32_t CORE_D300k_REG_MANU_CCOT: 6;
            __IO uint32_t CORE_LDO_ENPC_LDODIGI: 1;
            __IO uint32_t CORE_BUCK_LDOTUNE_H: 6;
        } BITS_B14;
    } u_B14;

    /* 0xB18        0x4000_2b18
        1:0     RW     CORE_XTAL_LPS_CAP_STEP      2'b01
        3:2     RW     CORE_XTAL_LPS_CAP_CYC       2'b00
        6:4     RW     CORE_XTAL_OV_UNIT           3'b000
        8:7     RW     CORE_XTAL_OV_RATIO          2'b01
        11:9    RW     CORE_XTAL_MODE              3'b100
        13:12   RW     CORE_XTAL_MODE_DLY          2'b00
        14      RW     CORE_XTAL_MODE_NMPC         1b'0
        15      RW     XTAL_LDOPC_SEL              1'b0
        16      RW     XTAL_GATED_RFP              1'b0
        17      RW     XTAL_GATED_RFN              1'b0
        18      RW     XTAL_GATED_AFEP             1'b0
        19      RW     XTAL_GATED_AFEN             1'b0
        31:20   RW     RSVD                        12'h0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW0_1;
        struct
        {
            __IO uint32_t CORE_XTAL_LPS_CAP_STEP: 2;
            __IO uint32_t CORE_XTAL_LPS_CAP_CYC: 2;
            __IO uint32_t CORE_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE_XTAL_MODE: 3;
            __IO uint32_t CORE_XTAL_MODE_DLY: 2;
            __IO uint32_t CORE_XTAL_MODE_NMPC: 1;
            __IO uint32_t XTAL_LDOPC_SEL: 1;
            __IO uint32_t XTAL_GATED_RFP: 1;
            __IO uint32_t XTAL_GATED_RFN: 1;
            __IO uint32_t XTAL_GATED_AFEP: 1;
            __IO uint32_t XTAL_GATED_AFEN: 1;
            __IO uint32_t RESERVED_0: 12;
        } BITS_B18;
    } u_B18;

    /* 0xB1C        0x4000_2b1c
        1:0     RW     CORE_XTAL_LPS_CAP_STEP      2'b01
        3:2     RW     CORE_XTAL_LPS_CAP_CYC       2'b00
        6:4     RW     CORE_XTAL_OV_UNIT           3'b000
        8:7     RW     CORE_XTAL_OV_RATIO          2'b01
        11:9    RW     CORE_XTAL_MODE              3'b100
        13:12   RW     CORE_XTAL_MODE_DLY          2'b00
        14      RW     CORE_XTAL_MODE_NMPC         1b'0
        15      RW     XTAL_LDOPC_SEL              1'b0
        16      RW     XTAL_GATED_RFP              1'b0
        17      RW     XTAL_GATED_RFN              1'b0
        18      RW     XTAL_GATED_AFEP             1'b0
        19      RW     XTAL_GATED_AFEN             1'b0
        31:20   RW     RSVD                        12'h0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW4_1;
        struct
        {
            __IO uint32_t CORE_XTAL_LPS_CAP_STEP: 2;
            __IO uint32_t CORE_XTAL_LPS_CAP_CYC: 2;
            __IO uint32_t CORE_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE_XTAL_MODE: 3;
            __IO uint32_t CORE_XTAL_MODE_DLY: 2;
            __IO uint32_t CORE_XTAL_MODE_NMPC: 1;
            __IO uint32_t XTAL_LDOPC_SEL: 1;
            __IO uint32_t XTAL_GATED_RFP: 1;
            __IO uint32_t XTAL_GATED_RFN: 1;
            __IO uint32_t XTAL_GATED_AFEP: 1;
            __IO uint32_t XTAL_GATED_AFEN: 1;
            __IO uint32_t RESERVED_0: 12;
        } BITS_B1C;
    } u_B1C;

    /* 0xB20        0x4000_2b20
        1:0     RW     CORE_XTAL_LPS_CAP_STEP      2'b01
        3:2     RW     CORE_XTAL_LPS_CAP_CYC       2'b00
        6:4     RW     CORE_XTAL_OV_UNIT           3'b000
        8:7     RW     CORE_XTAL_OV_RATIO          2'b01
        11:9    RW     CORE_XTAL_MODE              3'b100
        13:12   RW     CORE_XTAL_MODE_DLY          2'b00
        14      RW     CORE_XTAL_MODE_NMPC         1b'0
        15      RW     XTAL_LDOPC_SEL              1'b0
        16      RW     XTAL_GATED_RFP              1'b0
        17      RW     XTAL_GATED_RFN              1'b0
        18      RW     XTAL_GATED_AFEP             1'b0
        19      RW     XTAL_GATED_AFEN             1'b0
        31:20   RW     RSVD                        12'h0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW5_1;
        struct
        {
            __IO uint32_t CORE_XTAL_LPS_CAP_STEP: 2;
            __IO uint32_t CORE_XTAL_LPS_CAP_CYC: 2;
            __IO uint32_t CORE_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE_XTAL_MODE: 3;
            __IO uint32_t CORE_XTAL_MODE_DLY: 2;
            __IO uint32_t CORE_XTAL_MODE_NMPC: 1;
            __IO uint32_t XTAL_LDOPC_SEL: 1;
            __IO uint32_t XTAL_GATED_RFP: 1;
            __IO uint32_t XTAL_GATED_RFN: 1;
            __IO uint32_t XTAL_GATED_AFEP: 1;
            __IO uint32_t XTAL_GATED_AFEN: 1;
            __IO uint32_t RESERVED_0: 12;
        } BITS_B20;
    } u_B20;

    /* 0xB24        0x4000_2b24
        1:0     RW     CORE_XTAL_LPS_CAP_STEP      2'b01
        3:2     RW     CORE_XTAL_LPS_CAP_CYC       2'b00
        6:4     RW     CORE_XTAL_OV_UNIT           3'b000
        8:7     RW     CORE_XTAL_OV_RATIO          2'b01
        11:9    RW     CORE_XTAL_MODE              3'b100
        13:12   RW     CORE_XTAL_MODE_DLY          2'b00
        14      RW     CORE_XTAL_MODE_NMPC         1b'0
        15      RW     XTAL_LDOPC_SEL              1'b0
        16      RW     XTAL_GATED_RFP              1'b0
        17      RW     XTAL_GATED_RFN              1'b0
        18      RW     XTAL_GATED_AFEP             1'b0
        19      RW     XTAL_GATED_AFEN             1'b0
        31:20   RW     RSVD                        12'h0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW6_1;
        struct
        {
            __IO uint32_t CORE_XTAL_LPS_CAP_STEP: 2;
            __IO uint32_t CORE_XTAL_LPS_CAP_CYC: 2;
            __IO uint32_t CORE_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE_XTAL_MODE: 3;
            __IO uint32_t CORE_XTAL_MODE_DLY: 2;
            __IO uint32_t CORE_XTAL_MODE_NMPC: 1;
            __IO uint32_t XTAL_LDOPC_SEL: 1;
            __IO uint32_t XTAL_GATED_RFP: 1;
            __IO uint32_t XTAL_GATED_RFN: 1;
            __IO uint32_t XTAL_GATED_AFEP: 1;
            __IO uint32_t XTAL_GATED_AFEN: 1;
            __IO uint32_t RESERVED_0: 12;
        } BITS_B24;
    } u_B24;

    /* 0xB28        0x4000_2b28
        1:0     RW     CORE_XTAL_LPS_CAP_STEP      2'b01
        3:2     RW     CORE_XTAL_LPS_CAP_CYC       2'b00
        6:4     RW     CORE_XTAL_OV_UNIT           3'b000
        8:7     RW     CORE_XTAL_OV_RATIO          2'b01
        11:9    RW     CORE_XTAL_MODE              3'b100
        13:12   RW     CORE_XTAL_MODE_DLY          2'b00
        14      RW     CORE_XTAL_MODE_NMPC         1b'0
        15      RW     XTAL_LDOPC_SEL              1'b0
        16      RW     XTAL_GATED_RFP              1'b0
        17      RW     XTAL_GATED_RFN              1'b0
        18      RW     XTAL_GATED_AFEP             1'b0
        19      RW     XTAL_GATED_AFEN             1'b0
        31:20   RW     RSVD                        12'h0
    */
    union
    {
        __IO uint32_t REG0X_AUTO_SW7_1;
        struct
        {
            __IO uint32_t CORE_XTAL_LPS_CAP_STEP: 2;
            __IO uint32_t CORE_XTAL_LPS_CAP_CYC: 2;
            __IO uint32_t CORE_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE_XTAL_MODE: 3;
            __IO uint32_t CORE_XTAL_MODE_DLY: 2;
            __IO uint32_t CORE_XTAL_MODE_NMPC: 1;
            __IO uint32_t XTAL_LDOPC_SEL: 1;
            __IO uint32_t XTAL_GATED_RFP: 1;
            __IO uint32_t XTAL_GATED_RFN: 1;
            __IO uint32_t XTAL_GATED_AFEP: 1;
            __IO uint32_t XTAL_GATED_AFEN: 1;
            __IO uint32_t RESERVED_0: 12;
        } BITS_B28;
    } u_B28;

} PERI_BLKCTRL_AUTO_SWITCH_TypeDef;


typedef struct
{
    /* 0x000        0x4000_2000
        3:0     R/W    r_cpu_div_sel                   4'h4
        4       R/W    r_cpu_div_en                    1'h1
        15:5    R/W    RSVD                            11'h0
        16      R/W    r_cpu_clk_src_sel               1'h0
        17      R/W    RSVD                            1'h0
        20:18   R/W    RSVD                            3'h0
        24:21   R/W    RSVD                            4'h0
        25      R/W    r_cpu_slp_bus_clk_ck_en         1'h1
        26      R/W    r_cpu_clk_src_en                1'h1
        27      R/W    r_cpu_clk_mux_0_cg_en           1'h0
        28      R/W    r_cpu_xtal_clk_cg_en            1'h1
        29      R/W    r_cpu_osc40_clk_cg_en           1'h1
        30      R/W    r_cpu_pll_clk_cg_en             1'h0
        31      R/W    r_cpu_pll_clk_src_sel           1'h0
    */
    union
    {
        __IO uint32_t REG_CPU_CLK_SEL;
        struct
        {
            __IO uint32_t r_cpu_div_sel: 4;
            __IO uint32_t r_cpu_div_en: 1;
            __IO uint32_t RESERVED_3: 11;
            __IO uint32_t r_cpu_clk_src_sel: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 3;
            __IO uint32_t RESERVED_0: 4;
            __IO uint32_t r_cpu_slp_bus_clk_ck_en: 1;
            __IO uint32_t r_cpu_clk_src_en: 1;
            __IO uint32_t r_cpu_clk_mux_0_cg_en: 1;
            __IO uint32_t r_cpu_xtal_clk_cg_en: 1;
            __IO uint32_t r_cpu_osc40_clk_cg_en: 1;
            __IO uint32_t r_cpu_pll_clk_cg_en: 1;
            __IO uint32_t r_cpu_pll_clk_src_sel: 1;
        } BITS_000;
    } u_000;

    /* 0x004        0x4000_2004
        0       R/W    r_cpu_slow_en                   1'h0
        1       R/W    r_cpu_slow_opt_wfi              1'h0
        2       R/W    RSVD                            1'h0
        3       R/W    r_cpu_auto_slow_filter_en       1'h1
        7:4     R/W    r_cpu_div_sel_slow              4'h4
        8       R/W    RSVD                            1'h0
        12:9    R/W    r_cpu_low_rate_valid_num1       4'h3
        13      R/W    r_cpu_div_en_slow               1'h0
        14      R/W    r_cpu_auto_slow_filter1_en      1'h1
        15      R/W    RSVD                            1'h0
        16      R/W    r_cpu_auto_slow_force_update    1'h0
        27:17   R/W    RSVD                            11'h0
        31:28   R/W    r_cpu_low_rate_valid_num        4'h3
    */
    union
    {
        __IO uint32_t REG_CPU_AUTO_SLOW_CTL;
        struct
        {
            __IO uint32_t r_cpu_slow_en: 1;
            __IO uint32_t r_cpu_slow_opt_wfi: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t r_cpu_auto_slow_filter_en: 1;
            __IO uint32_t r_cpu_div_sel_slow: 4;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t r_cpu_low_rate_valid_num1: 4;
            __IO uint32_t r_cpu_div_en_slow: 1;
            __IO uint32_t r_cpu_auto_slow_filter1_en: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t r_cpu_auto_slow_force_update: 1;
            __IO uint32_t RESERVED_0: 11;
            __IO uint32_t r_cpu_low_rate_valid_num: 4;
        } BITS_004;
    } u_004;

    /* 0x008        0x4000_2008
        31:0    R/W    RSVD                            32'h0
    */
    __IO uint32_t REG_DSP_CLK_SEL_1;

