rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0x00C        0x4000_200c
        2:0     R/W    RSVD                            3'h0
        3       R/W    RSVD                            1'h0
        6:4     R/W    RSVD                            3'h0
        7       R/W    RSVD                            1'h0
        10:8    R/W    RSVD                            3'h0
        11      R/W    RSVD                            1'h0
        14:12   R/W    clk_low_div_sel                 3'h2
        15      R/W    clk_low_div_en                  1'h1
        18:16   R/W    bus_clk_div_sel                 3'h0
        19      R/W    bus_clk_div_en                  1'h1
        20      R/W    r_40m_clk_src_sel               1'h0
        21      R/W    r_40m_clk_ck_en                 1'h1
        31:22   R/W    RSVD                            10'h0
    */
    union
    {
        __IO uint32_t REG_APB_CLK_CTL;
        struct
        {
            __IO uint32_t RESERVED_6: 3;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t RESERVED_4: 3;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t RESERVED_2: 3;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t clk_low_div_sel: 3;
            __IO uint32_t clk_low_div_en: 1;
            __IO uint32_t bus_clk_div_sel: 3;
            __IO uint32_t bus_clk_div_en: 1;
            __IO uint32_t r_40m_clk_src_sel: 1;
            __IO uint32_t r_40m_clk_ck_en: 1;
            __IO uint32_t RESERVED_0: 10;
        } BITS_00C;
    } u_00C;

    /* 0x010        0x4000_2010
        31:0    R/W    dummy_010                       32'h0
    */
    union
    {
        __IO uint32_t REG_DUMMY_10_CTRL;
        struct
        {
            __IO uint32_t dummy_010: 32;
        } BITS_010;
    } u_010;

    /* 0x014        0x4000_2014
        31:0    R/W    dummy_014                       32'h0
    */
    union
    {
        __IO uint32_t REG_DUMMY_14_CTRL;
        struct
        {
            __IO uint32_t dummy_014: 32;
        } BITS_014;
    } u_014;

    /* 0x18         0x4000_2018
        0       R/W    wdg_ck_en                       1'h0
        1       R/W    otp_ck_en                       1'h0
        2       R/W    otp_func_en                     1'h0
        3       R/W    data_ram_ck_en                  1'h0
        4       R/W    data_ram_func_en                1'h0
        5       R/W    soc_vendor_ck_en                1'h0
        6       R/W    ctrlap_ck_en                    1'h0
        31:7    R/W    RSVD                            25'h0
    */
    union
    {
        __IO uint32_t REG_PLATFORM_CTRL0;
        struct
        {
            __IO uint32_t wdg_ck_en: 1;
            __IO uint32_t otp_ck_en: 1;
            __IO uint32_t otp_func_en: 1;
            __IO uint32_t data_ram_ck_en: 1;
            __IO uint32_t data_ram_func_en: 1;
            __IO uint32_t soc_vendor_ck_en: 1;
            __IO uint32_t ctrlap_ck_en: 1;
            __IO uint32_t RESERVED_0: 25;
        } BITS_018;
    } u_018;

    __IO uint32_t RSVD_0x1c[2];

    /* 0x24         0x4000_2024
        0       R/W    r_cpu_slow_opt_gdma             1'h0
        1       R/W    r_cpu_slow_opt_ppe              1'h0
        2       R/W    r_cpu_slow_opt_bt_sram          1'h0
        3       R/W    r_cpu_slow_opt_sdio             1'h0
        4       R/W    r_cpu_slow_opt_spic0            1'h0
        5       R/W    r_cpu_slow_opt_spic1            1'h0
        6       R/W    r_cpu_slow_opt_spic2            1'h0
        7       R/W    r_cpu_slow_opt_disp             1'h0
        8       R/W    r_cpu_slow_opt_at_tx            1'h0
        9       R/W    r_cpu_slow_opt_at_rx            1'h0
        10      R/W    r_cpu_slow_opt_usb              1'h0
        11      R/W    r_cpu_slow_opt_gmac             1'h0
        12      R/W    r_cpu_slow_opt_spi0_hs          1'h0
        13      R/W    r_cpu_auto_slow_new0            1'h0
        14      R/W    r_cpu_auto_slow_new1            1'h0
        15      R/W    r_cpu_auto_slow_new2            1'h0
        16      R/W    r_cpu_auto_slow_new3            1'h0
        17      R/W    r_cpu_auto_slow_new4            1'h0
        18      R/W    r_cpu_auto_slow_new5            1'h0
        19      R/W    r_cpu_auto_slow_new6            1'h0
        20      R/W    r_cpu_auto_slow_new7            1'h0
        21      R/W    r_cpu_auto_slow_new8            1'h0
        22      R/W    r_cpu_auto_slow_new9            1'h0
        23      R/W    r_cpu_auto_slow_new10           1'h0
        31:24   R/W    RSVD                            8'h0
    */
    union
    {
        __IO uint32_t REG_AUTO_SLOW_CTRL0;
        struct
        {
            __IO uint32_t r_cpu_slow_opt_gdma: 1;
            __IO uint32_t r_cpu_slow_opt_ppe: 1;
            __IO uint32_t r_cpu_slow_opt_bt_sram: 1;
            __IO uint32_t r_cpu_slow_opt_sdio: 1;
            __IO uint32_t r_cpu_slow_opt_spic0: 1;
            __IO uint32_t r_cpu_slow_opt_spic1: 1;
            __IO uint32_t r_cpu_slow_opt_spic2: 1;
            __IO uint32_t r_cpu_slow_opt_disp: 1;
            __IO uint32_t r_cpu_slow_opt_at_tx: 1;
            __IO uint32_t r_cpu_slow_opt_at_rx: 1;
            __IO uint32_t r_cpu_slow_opt_usb: 1;
            __IO uint32_t r_cpu_slow_opt_gmac: 1;
            __IO uint32_t r_cpu_slow_opt_spi0_hs: 1;
            __IO uint32_t r_cpu_auto_slow_new0: 1;
            __IO uint32_t r_cpu_auto_slow_new1: 1;
            __IO uint32_t r_cpu_auto_slow_new2: 1;
            __IO uint32_t r_cpu_auto_slow_new3: 1;
            __IO uint32_t r_cpu_auto_slow_new4: 1;
            __IO uint32_t r_cpu_auto_slow_new5: 1;
            __IO uint32_t r_cpu_auto_slow_new6: 1;
            __IO uint32_t r_cpu_auto_slow_new7: 1;
            __IO uint32_t r_cpu_auto_slow_new8: 1;
            __IO uint32_t r_cpu_auto_slow_new9: 1;
            __IO uint32_t r_cpu_auto_slow_new10: 1;
            __IO uint32_t RESERVED_0: 8;
        } BITS_024;
    } u_024;

    __IO uint32_t RSVD_0028[1];
    __IO uint32_t RSVD_002c[1];

} PERI_BLKCTRL_PF_CLK_TypeDef;


typedef struct
{
    /* 0xC00        0x4000_2c00
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC0;

    /* 0xC04        0x4000_2c04
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC1;

    /* 0xC08        0x4000_2c08
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC2;

    /* 0xC0C        0x4000_2c0c
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC3;

    /* 0xC10        0x4000_2c10
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC4;

    /* 0xC14        0x4000_2c14
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC5;

    /* 0xC18        0x4000_2c18
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC6;

    /* 0xC1C        0x4000_2c1c
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC7;

    /* 0xC20        0x4000_2c20
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC8;

    /* 0xC24        0x4000_2c24
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC9;

    /* 0xC28        0x4000_2c28
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC10;

    /* 0xC2C        0x4000_2c2c
        31:0    R/W    RSVD                    32'h0
    */
    __IO uint32_t REG_MISC11;

    /* 0xC30        0x4000_2c30
        0       R/W    pke_irom_wr_en_fpga     1'h0
        2:1     R/W    sdio_cclk_in_sel_fpga   2'h0
        4:3     R/W    flash_clk_sel_fpga      2'h0
        6:5     R/W    debug_port_sel_fpga     2'h0
        7       R/W    DUMMY2                  1'h0
        9:8     R/W    utmi_clk_sel_fpga       2'h0
        10      R/W    fake_trace_addr_en      1'h1
        15:11   R/W    DUMMY1                  5'h0
        17:16   R/W    occ_debug_en            2'h0
        20:18   R/W    occ_debug_clk_sel0      3'h0
        23:21   R/W    occ_debug_clk_sel1      3'h0
        31:24   R/W    DUMMY                   8'h0
    */
    union
    {
        __IO uint32_t REG_MISC12;
        struct
        {
            __IO uint32_t pke_irom_wr_en_fpga: 1;
            __IO uint32_t sdio_cclk_in_sel_fpga: 2;
            __IO uint32_t flash_clk_sel_fpga: 2;
            __IO uint32_t debug_port_sel_fpga: 2;
            __IO uint32_t DUMMY2: 1;
            __IO uint32_t utmi_clk_sel_fpga: 2;
            __IO uint32_t fake_trace_addr_en: 1;
            __IO uint32_t DUMMY1: 5;
            __IO uint32_t occ_debug_en: 2;
            __IO uint32_t occ_debug_clk_sel0: 3;
            __IO uint32_t occ_debug_clk_sel1: 3;
            __IO uint32_t RESERVED_0: 8;
        } BITS_C30;
    } u_C30;

