rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    __IO uint32_t RSVD_0xc34[2];

    /* 0xC3C        0x4000_2c3c
        0       R/W    pdck_reset_n            1'b0
        1       R/W    EN_XTAL_PDCK_DIGI       1'b0
        2       R/W    PDCK_SEARCH_MODE        1'b0
        4:3     R/W    PDCK_WAIT_CYC           2'b01
        10:5    R/W    VREF_MANUAL             6'h3F
        16:11   R/W    VREF_INIT               6'h3F
        18:17   R/W    XTAL_PDCK_UNIT          2'b01
        24:19   R/W    XPDCK_VREF_SEL          6'h0
        25      R/W    PDCK_LPOW               1'b0
        27:26   R/W    DUMMY3                  2'h0
        31:28   R      pdck_state              4'h0
    */
    union
    {
        __IO uint32_t REG_XTAL_PDCK;
        struct
        {
            __IO uint32_t pdck_reset_n: 1;
            __IO uint32_t EN_XTAL_PDCK_DIGI: 1;
            __IO uint32_t PDCK_SEARCH_MODE: 1;
            __IO uint32_t PDCK_WAIT_CYC: 2;
            __IO uint32_t VREF_MANUAL: 6;
            __IO uint32_t VREF_INIT: 6;
            __IO uint32_t XTAL_PDCK_UNIT: 2;
            __IO uint32_t XPDCK_VREF_SEL: 6;
            __IO uint32_t PDCK_LPOW: 1;
            __IO uint32_t DUMMY3: 2;
            __I uint32_t pdck_state: 4;
        } BITS_C3C;
    } u_C3C;

    /* 0xC40        0x4000_2c40
        0       R/W    TMETER_IN_EN            1'b0
        1       R      TMETER_OK               1'h0
        31:2    R/W    REG_TMETER_DUMMY        30'h0
    */
    union
    {
        __IO uint32_t REG_TMETER;
        struct
        {
            __IO uint32_t TMETER_IN_EN: 1;
            __I uint32_t TMETER_OK: 1;
            __IO uint32_t REG_TMETER_DUMMY: 30;
        } BITS_C40;
    } u_C40;

    __IO uint32_t RSVD_0xc44[1];

    /* 0xC48        0x4000_2c48
        31:0    R      GPIO_RDATA_SCAN         32'h0
    */
    union
    {
        __IO uint32_t REG_MISC15;
        struct
        {
            __I uint32_t GPIO_RDATA_SCAN: 32;
        } BITS_C48;
    } u_C48;

    __IO uint32_t RSVD_0xc4c[5];

    /* 0xC60        0x4000_2c60
        0       RW     rst_n_aac               1'b0
        1       RW     offset_plus             1'b0
        7:2     RW     XAAC_GM_offset          6'h0
        8       RW     GM_STEP                 1'b0
        14:9    RW     GM_INIT                 6'h3F
        17:15   RW     XTAL_CLK_SET            3'b101
        23:18   RW     GM_STUP                 6'h3F
        29:24   RW     GM_MANUAL               6'h1F
        30      RW     r_EN_XTAL_AAC_DIGI      1'b0
        31      RW     r_EN_XTAL_AAC_TRIG      1'b0
    */
    union
    {
        __IO uint32_t REG_AAC_CTRL0;
        struct
        {
            __IO uint32_t rst_n_aac: 1;
            __IO uint32_t offset_plus: 1;
            __IO uint32_t XAAC_GM_offset: 6;
            __IO uint32_t GM_STEP: 1;
            __IO uint32_t GM_INIT: 6;
            __IO uint32_t XTAL_CLK_SET: 3;
            __IO uint32_t GM_STUP: 6;
            __IO uint32_t GM_MANUAL: 6;
            __IO uint32_t r_EN_XTAL_AAC_DIGI: 1;
            __IO uint32_t r_EN_XTAL_AAC_TRIG: 1;
        } BITS_C60;
    } u_C60;

    /* 0xC64        0x4000_2c64
        0       R      XAAC_BUSY               1'b0
        1       R      XAAC_READY              1'b0
        7:2     R      XTAL_GM_OUT             6'h1F
        11:8    R      xaac_curr_state         4'h0
        12      R/W    EN_XTAL_AAC_GM          1'b0
        13      R/W    EN_XTAL_AAC_PKDET       1'b0
        14      R      XTAL_PKDET_OUT          1'b0
        15      R/W    RSVD                    1'b0
        31:16   R/W    RSVD                    16'h0129
    */
    union
    {
        __IO uint32_t REG_AAC_CTRL1;
        struct
        {
            __I uint32_t XAAC_BUSY: 1;
            __I uint32_t XAAC_READY: 1;
            __I uint32_t XTAL_GM_OUT: 6;
            __I uint32_t xaac_curr_state: 4;
            __IO uint32_t EN_XTAL_AAC_GM: 1;
            __IO uint32_t EN_XTAL_AAC_PKDET: 1;
            __I uint32_t XTAL_PKDET_OUT: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 16;
        } BITS_C64;
    } u_C64;

    __IO uint32_t RSVD_0xc68[30];

    /* 0xCE0        0x4000_2ce0
        0       R/W    det_enable              1'b0
        1       R/W    vbus_det                1'b0
        2       R/W    skip_sec_det            1'b0
        3       R/W    DUMMY6                  1'b0
        7:4     R/W    DUMMY5                  4'h0
        8       R      sdp_op5a                1'h0
        9       R      dcp_cdp_1p5a            1'h0
        10      R      cdp_det                 1'h0
        11      R      dcp_det                 1'h0
        12      R      others_op5a             1'h0
        13      R      apple_1p0a              1'h0
        14      R      apple_2p1a              1'h0
        15      R      apple_2p4a              1'h0
        16      R      det_is_done             1'h0
        17      R      note_2p0a               1'h0
        18      R      sony_charger            1'h0
        28:19   R/W    DUMMY4                  9'h0
        29      R/W    dcp_option              1'h1
        30      R/W    bypass_non_std_det      1'h0
        31      R/W    bypass_dcd_dbnc         1'h0
    */
    union
    {
        __IO uint32_t REG_BC12_CTRL1;
        struct
        {
            __IO uint32_t det_enable: 1;
            __IO uint32_t vbus_det: 1;
            __IO uint32_t skip_sec_det: 1;
            __IO uint32_t DUMMY6: 1;
            __IO uint32_t DUMMY5: 4;
            __I uint32_t sdp_op5a: 1;
            __I uint32_t dcp_cdp_1p5a: 1;
            __I uint32_t cdp_det: 1;
            __I uint32_t dcp_det: 1;
            __I uint32_t others_op5a: 1;
            __I uint32_t apple_1p0a: 1;
            __I uint32_t apple_2p1a: 1;
            __I uint32_t apple_2p4a: 1;
            __I uint32_t det_is_done: 1;
            __I uint32_t note_2p0a: 1;
            __I uint32_t sony_charger: 1;
            __IO uint32_t DUMMY4: 10;
            __IO uint32_t dcp_option: 1;
            __IO uint32_t bypass_non_std_det: 1;
            __IO uint32_t bypass_dcd_dbnc: 1;
        } BITS_CE0;
    } u_CE0;

