rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/pcc_reg.h
    /* 0xCE4        0x4000_2ce4
        6:0     R/W    fw_write_bus            7'h0
        7       R/W    DUMMY9                  1'h0
        8       R/W    fw_ctrl_mode            1'b0
        15:9    R/W    DUMMY8                  7'h0
        25:16   R      fw_read_bus             10'h0
        31:26   R/W    DUMMY7                  6'h0
    */
    union
    {
        __IO uint32_t REG_BC12_CTRL2;
        struct
        {
            __IO uint32_t fw_write_bus: 7;
            __IO uint32_t DUMMY9: 1;
            __IO uint32_t fw_ctrl_mode: 1;
            __IO uint32_t DUMMY8: 7;
            __I uint32_t fw_read_bus: 10;
            __IO uint32_t DUMMY7: 6;
        } BITS_CE4;
    } u_CE4;

    /* 0xCE8        0x4000_2ce8
        15:0    R/W    DCD_A_MIN_TIME          16'h200
        31:16   R/W    DCD_B_MIN_TIME          16'h3E80
    */
    union
    {
        __IO uint32_t REG_BC12_CTRL3;
        struct
        {
            __IO uint32_t DCD_A_MIN_TIME: 16;
            __IO uint32_t DCD_B_MIN_TIME: 16;
        } BITS_CE8;
    } u_CE8;

    /* 0xCEC        0x4000_2cec
        15:0    R/W    PRI_DET_MIN_TIME        16'h500
        31:16   R/W    NOTE_DET_MIN_TIME       16'h140
    */
    union
    {
        __IO uint32_t REG_BC12_CTRL4;
        struct
        {
            __IO uint32_t PRI_DET_MIN_TIME: 16;
            __IO uint32_t NOTE_DET_MIN_TIME: 16;
        } BITS_CEC;
    } u_CEC;

    /* 0xCF0        0x4000_2cf0
        15:0    R/W    WAIT_A_MIN_TIME         16'h280
        31:16   R/W    SECOND_DET_MIN_TIME     16'h540
    */
    union
    {
        __IO uint32_t REG_BC12_CTRL5;
        struct
        {
            __IO uint32_t WAIT_A_MIN_TIME: 16;
            __IO uint32_t SECOND_DET_MIN_TIME: 16;
        } BITS_CF0;
    } u_CF0;

    /* 0xCF4        0x4000_2cf4
        15:0    R/W    APPLE_DET_MIN_TIME      16'h140
        31:16   R/W    DUMMY10                 16'h0
    */
    union
    {
        __IO uint32_t REG_BC12_CTRL6;
        struct
        {
            __IO uint32_t APPLE_DET_MIN_TIME: 16;
            __IO uint32_t DUMMY10: 16;
        } BITS_CF4;
    } u_CF4;

} PERI_BLKCTRL_INTERNAL_TypeDef;

/* reference: Bee4_PERI-ON_20221017_v2.xlsx */
typedef struct
{
    union
    {
        __IO uint32_t REG_SEC_CTRL0;
        struct
        {
            __IO uint32_t rng_func_en: 1;
            __IO uint32_t rng_ck_en: 1;
            __IO uint32_t rng_sfosc_sel: 1;
            __IO uint32_t rng_sfosc_div_sel: 3;
            __IO uint32_t RESERVED_9: 8;
            __IO uint32_t RESERVED_8: 1;
            __IO uint32_t RESERVED_7: 1;
            __IO uint32_t RESERVED_6: 1;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t sha2_ck_en: 1;
            __IO uint32_t sha2_func_en: 1;
            __IO uint32_t aes_ck_en: 1;
            __IO uint32_t aes_func_en: 1;
            __IO uint32_t pke_ck_en: 1;
            __IO uint32_t pke_func_en: 1;
            __IO uint32_t pke_clk_always_enable: 1;
            __IO uint32_t pke_clk_always_disable: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 2;
        } BITS_400;
    } u_400;

    __IO uint32_t REG_SEC_CTRL1;

    __IO uint32_t REG_SEC_CTRL2;

    __IO uint32_t REG_SEC_CTRL3;

    __IO uint32_t REG_SEC_CTRL4;

    __IO uint32_t REG_SEC_CTRL5;

    __IO uint32_t REG_SEC_CTRL6;

    __IO uint32_t REG_SEC_CTRL7;

} SECURE_PERIPHERAL_CLOCK_CONTROL_TypeDef;

#define PERIBLKCTRL_PF_CLK_REG_BASE        0x40002000UL
#define PERIBLKCTRL_PERICLK_REG_BASE0      0x40002300UL
#define PERIBLKCTRL_SEC_PERICLK_REG_BASE   0x40002400UL
#define PERIBLKCTRL_AUDIO_REG_BASE         0x40002700UL
#define PERIBLKCTRL_INTERNAL_AUTO_REG_BASE 0x40002A00UL
#define PERIBLKCTRL_AUTO_SWITCH_REG_BASE   0x40002B00UL
#define PERIBLKCTRL_INTERNAL_REG_BASE      0x40002C00UL

#define PERIBLKCTRL_PERI_CLK            ((PERI_BLKCTRL_PERI_CLK_TypeDef *) PERIBLKCTRL_PERICLK_REG_BASE0)
#define PERIBLKCTRL_AUDIO               ((PERIBLKCTRL_AUDIO_TypeDef *) PERIBLKCTRL_AUDIO_REG_BASE)
#define PERIBLKCTRL_INTERNAL_AUTO       ((PERI_BLKCTRL_INTERNAL_AUTO_TypeDef *) PERIBLKCTRL_INTERNAL_AUTO_REG_BASE)
#define PERIBLKCTRL_AUTO_SWITCH         ((PERI_BLKCTRL_AUTO_SWITCH_TypeDef *) PERIBLKCTRL_AUTO_SWITCH_REG_BASE)
#define PERIBLKCTRL_PF_CLK              ((PERI_BLKCTRL_PF_CLK_TypeDef   *) PERIBLKCTRL_PF_CLK_REG_BASE)
#define PERIBLKCTRL_INTERNAL            ((PERI_BLKCTRL_INTERNAL_TypeDef *) PERIBLKCTRL_INTERNAL_REG_BASE)
#define SECURE_PERIPHERAL_CLOCK_CONTROL ((SECURE_PERIPHERAL_CLOCK_CONTROL_TypeDef *) PERIBLKCTRL_SEC_PERICLK_REG_BASE)

#endif //#define PCC_REG_H 
